[
  {
    "desc": ",\n* Model/Servers,\n,\nWe're currently looking to hire Fun Energized and DEDICATED Model Servers to join our team. Make an avg. of $300 to $500 per shift in cash. If your interested in working with us and believe that you'd be a strong asset to our club. We'll train you to have knowledge of beverages and food service. Will be expected to serve guests in a timely manner with a great attitude. ,\n,\nIf your wanting a job that leads to a better job like Bartender or Door Hostess please stop by from 11am to 11pm. Ask for the manager. or apply online.,\n,\nMUST BE 21 AND UP TO APPLY.,\nMUST BE AVAILABLE WEEKENDS. ,\n,\n,\n* ENTERTAINERS / DANCERS ,\n,\nNew Entertainers make an average of $700 to $2,000 per shift. Make money anytime or as many hours as you want. Whether it be one day a week or five. You make your own hours to fit your busy life. We're flexible with any hours you need. Must be outgoing & friendly. No experience necessary. We train on the buddy system here so all new entertainers are paired with a mentor. To help them thru their first day at the club.,\nJust stop by for a tour of the club.  ,\n,\nAlso hiring for: Barbacks, Floorman, Doorman.,\n,\nApply in person between the hours of 11am-11pm. for a tour of the club. Ask for the Dance Manager. ,\n,\n10601 Plano Rd.,\nDallas, TX . 75238,\n214-341-6643,\n,\n,\n,\n,\n,\n,\nGarland, Richardson, Mesquite, East Dallas, Plano, Allan, Mckinney longview tyler Wylie Sashse Rowlett Rockwall , Tyler , Sherman , gentlemans club , strip club , sports bar , bar , stripclub,"
  },
  {
    "desc": ",\nRapidly growing national printing & mailing company is seeking an administrative assistant. Light computer work, answering calls, light customer service and inventory reconciliation. Will work in coordination with our customer service manager. Must be familiar with Outlook, Excel and Windows 10. Low stress --- good environment. APPLY IN PERSON (ask for Tommy, Danny or Brett): CFC Print & Mail, 2800 113th St. Suite 300, Grand Prairie TX   75050. This position will fill quickly.,"
  },
  {
    "desc": ",\nLooking for experienced HVAC installer for a temporary project I could pay by the hour or some of the job out it is primarily sheet metal duct,"
  },
  {
    "desc": ",\n* Model/Servers,\n,\nWe're currently looking to hire Fun Energized and DEDICATED Model/Servers to join our team. Make an avg. of $300 to $500 per shift in cash. If your interested in working with us and believe that you'd be a strong asset to our club. We'll train you to have knowledge of beverages and food service. Will be expected to serve guests in a timely manner with a great attitude.,\n,\nIf your wanting a job that leads to a better job like Bartender or Door Hostess please stop by from 11am to 11pm. Ask for the manager. or apply online.,\n,\nMUST BE 21 AND UP TO APPLY.,\nMUST BE AVAILABLE WEEKENDS.,\n,\n,\n* ENTERTAINERS / DANCERS,\n,\nNew Entertainers make an average of $800 to $2,000 per day. Make money anytime or as many hours as you want. Whether it be one day a week or five. You make your own hours to fit your busy life. We're flexible with any hours you needs. Must be outgoing & friendly. No experience necessary. We train on the buddy system here so all new entertainers are paired with a mentor.,\nJust stop by for a tour of the club.,\n,\nAlso hiring for: Barbacks, Floorman, Doorman. ,\n,\nApply in person between the hours of 11am-11pm. for a tour of the club. Ask for the Dance Manager,\n,\n10601 Plano Rd.,\nDallas, TX . 75238,\n214-341-6643,\n,\n,\n,\n,\n,\n,\n,\n,\nGarland, Richardson, Mesquite, East Dallas, Plano, Allan, Mckinney longview tyler Wylie Sashse Rowlett Rockwall , Tyler , Sherman , gentlemans club , strip club , sports bar , bar , stripclub,"
  },
  {
    "desc": ",\nTHE \"2 DAY\" BUSINESS,\n,\nTo listen to my audio overview again:,\nMYGASSAVINGS.INFO,\n,\nHere's How to Build a Substantial Business from,\nHome in the Next 2 DAYS.,\n,\nTHE NEXT STEP is to go here: gasmoney.info,\nand watch the videos.,\n,\nTHEN... sign up and let's rock this. Or call me,\nwith questions."
  },
  {
    "desc": ",\nCDL Class A full time local/ regional driver needed in Dallas/ Fort Worth area ,\n,\nMust have at least 2 years of experience/ clean record ,\n,\nPay $28/hr ,\n,\nPlease reply to the email if you are interested or call/ text (seven seven three) 550-2365 - Violet,\n,\nIn Spanish - Call (909)644-2276 - Martin ,\n,\nThank you ,\nViolet,\n,"
  },
  {
    "desc": ",\nNecesito personal de limpieza con o sin Experiencia, pago semanalmente Trabajo de 8:30 a 5,"
  },
  {
    "desc": ",\nSeeking a licensed AC company in the Dallas area capable of quoting 3+ ac install jobs a day plus installing 5+ systems a week. We are a home energy marketing and referral business, with many years in the industry. We've expanded to the local market and have customer referrals for new AC retrofits/installs in Dallas and suburbs.,\n,\nWe send phone calls and form appointment requests directly to your office. These are high-quality leads of active buyers looking for new AC systems. They are only sent to you. Every time you install one of these systems, you pay us a referral fee of $960 - only pay on systems that are sold and installed. No upfront cost to you. You collect payment from the customer. We invoice you after each sale. To keep the leads flowing to your business, you must be scheduling and closing the sales at an above-average pace.,\n,\nRequirements:,\n,\n• State HVAC license,\n• competitive pricing,\n• customer financing,\n• offer popular brands,\n• have sales closers.,\n• be able to handle 3+ quote appts a day,\n• dedicated customer service people answering phones.,\n• be able to offer same-day appointments for quotes,\n• be able to do same-day or early the next-morning installs.,\n,\nCustomers are in Dallas and suburbs. Let us know what you can cover. (Areas available throughout the state.),\n,\nIf interested, please complete this form and we'll get back to you quickly:,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n,\n,US Transport,"
  },
  {
    "desc": ",\nSchaper Company is looking for commercial painters at our Dallas/Fort Worth Area office. Looking for committed and hard-working crew members to join our team.,\n,\nMust:,\n- Have a MINIMUM of 5 years experience commercial painting and/or water proofing . (Please do not contact us if you do not have painting experience),\n- Be willing to work nights, weekends and holidays as needed.,\n- Willing to travel when necessary (Will be compensated per diem and paid travel expenses),\n- Must have basic painting tools,\n- Must be able to drive Scissor lift and Boom Lift.,\n- Be punctual, reliable, trustworthy and organized.,\n- Have a valid driver's license, insurance and clean driving record.,\n- Must have your own Hand Tools,\n- Reliable Transportation,\n,\n* Competitive Pay for right person ,\n* Paid Weekly,\n* Company Sponsored Benefits,\n,\nPlease call or text Ed at 408.591.9037,"
  },
  {
    "desc": ",\nClass A Cdl driver needed , full time employment. Two years driving experience.Home every day, good pay,"
  },
  {
    "desc": ",\n,\n,\nVeho is a platform made for drivers to help deliver packages for businesses. Looking for top notch drivers to complete these deliveries! ,\n,\nDrivers love delivering with Veho because we provide,\n- Upfront earnings - know what you will earn to complete a route before committing to it.,\n- Route transparency - Book routes that geographically fit your preferred driving areas.,\n- A simple process to get on the road - once you’re signed up and active you’re ready to go!,\n\n,\nBasic Requirements,\n- At least 25 years old,\n- Regular access to a vehicle (full sized sedan or larger),\n- Valid Driver's License, Vehicle Registration, and Vehicle insurance,\n- Own and able to use a recent smartphone,\n- Able to lift up to 50 lbs with or without accommodation,\n- Eligible to work in the U.S.,\n,\nAdditional Information,\nAlready a driver for other platforms? We love that! Add to your earnings by also driving with Veho. ,\nRegister today to be one of the first drivers in your area!,\nJob Types: Part-time, Contract,\nPay: $18.00 - $25.00 per hour,"
  },
  {
    "desc": ",\nDescripcion del empleo:,\n,\nEl Crowne Plaza de Dallas Downtown es un hotel de lujo de 300 habitaciones con 30,000 pies cuadrados de espacio versátil para reuniones y banquetes, está buscando amas de llaves. Debe ser capaz de comunicarse en inglés.,\n,\nPodrias ganar hasta $136 por dia!!!  Aplicar in persona y pregunta por Brenda.  Email: billa@crownedallas.com. Teléfono: 214-742-5678,\n,\nBono de $100 para todos los nuevos empleados al completar  su primera semana completa de trabajo***,\n,\nPodrias ganar hasta $136 por dia!!!  Aplicar in persona y pregunta por Brenda.  Email: billa@crownedallas.com. Teléfono: 214-742-5678,\n,\n1015 Elm Street,\nDallas, TX  75202,\n,\nLas tareas diarias incluirán:,\n,\nGarantizar que todas nuestras habitaciones se limpien y desinfecten según los estándares de la marca,\n,\nInspeccionar salas limpias para garantizar que se cumplan nuestros estándares,\n,\nLimpiar las áreas públicas y desinfectar.,\n,\nComunicar los elementos de mantenimiento a nuestro gerente de mantenimiento,\n,\nAyudar a la gerencia con las tareas asignadas.,\n,\nPor favor, enviar  su currículum para su consideración inmediata.,\n,\nGracias"
  },
  {
    "desc": ",\nThis CLIMATE CONTROLLED / AIR CONDITIONED warehouse - not too hot - is located close to DFW Airport in Grapevine. ALL positions TEMP-to-HIRE. Starting pay $15.00-$17.25 depending on shift and position. Easy access for North Ft. Worth/Tarrant County and Mid-City residents - Ft. Worth, Irving, Euless, Hurst, Watauga, North Richland Hills, Grapevine, Coppell, Lewisville - many shifts start and end outside busy traffic periods. IMMEDIATE openings so apply this weekend and start next week!,\n,\n•\tFULL-TIME POSITIONS:,\n,\n\t\t$17.25 MATERIALS / FORKLIFT - Mon-Thu 4 DAY WORK WEEK!,\n\t\t  \t***  Forklift - 2 yrs. preferred,\n\t\t  \t***  2nd shift / 2:30pm-1:00am,\n,\n\t\t$16.25 MATERIALS - 5 days a week,\n\t\t  \t***  1st shift / 5:00am-1:30pm,\n,\n\t\t$16.75 MATERIALS - 5 days a week,\n\t\t  \t***  Swing 2nd shift / 12 noon-8:30pm,\n\t\t,\n\t\t,\n•\tPART-TIME POSITIONS:,\n,\n\t\t$16.25 MATERIALS,\n\t\t  \t***  5:00am-10:00pm,\n\t\t  \t***  Forklift - 2 yrs. preferred,\n\t\t\t\t,\n*** OTHER SHIFTS OPEN WEEKLY ***,\n,\n REQUIREMENTS:,\n,\n\t                          *** RESUME for all positions except General Labor, Truck Loader, and Cardboard ***,\n,\n•\tFORKLIFT - 2 yrs. preferred (Sit down or Order Selector/Cherry Picker),\n•\tALL OTHERS - WILL TRAIN,\n•\tNO Felonies within last 7 years,\n•\tDrug free - Must pass drug screen,\n,\n       ***   call for more information and let us know your availability   ***,\n,\nTO APPLY:,\n,\n•\tText \"Grapevine\" and position of interest to 817.600.7136 and a representative will text/call you,\n,\n        OR,\n,\n•\tClick \"Apply Now\" at www.TheArtOfStaffing.com,\n,\nThese positions are electable as temp-to-hire with an international corporation that offers a substantial benefit package to full-time employees.,"
  },
  {
    "desc": ",\nStaff Zone is looking for a full-time Van Driver to join our Irving team!,\n,\nCompensation:,\n,\n$625.00 Weekly,\nMonthly bonus opportunity,\nMedical benefits available,\nTeamwork atmosphere,\nContinuous training and development,\nFrequent bonus and contest opportunities,\nJob Duties Include:,\n,\nTransport Staff Zone's workforce to and from job sites,\nAdhere and enforce Staff Zone's driver and passenger safety policies and procedures,\nMaintain branch van clear of floor debris and obstacles that can hinder line of sight for driver,\nPost Flyers and help clean office,\nJob Requirements:,\n,\nHigh School Diploma/GED,\nM-F split shifts and rotating weekends (Start time is 4:30 AM - 9AM then 2PM to 6PM),\nCurrent valid Texas driver's license with eligible MVR (Clean Driving Record),\nWilling to submit to a criminal background check and drug screen, including Marijuana,\nMust have own form of transportation,\nIdeal Candidates:,\n,\nExperience preferred,\nCommitted to safety at ALL times,\nExcellent attendance,\nResides no more than 10 miles from our branch location (zip code 75038),\nIf possible, please apply in person at the below address:,\n,\n4026 N Belt Line Rd, Irving, TX 75038"
  },
  {
    "desc": ",\n,\n,\n,\n,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nNecesito personal de limpieza con o sin Experiencia, pago semanalmente,"
  },
  {
    "desc": ",\nBE PART OF THE FAMILY,\n,\nWell-established DOWNTOWN restaurant is looking for FULL time KITCHEN MANAGER/LINE COOK.,\nCandidates must have EXPERIENCE in Italian cuisine. ,\n$20-22/Hour ,\n,\nPlease call Milan ,\n312.804.5875,\n,\nRAVENNA-Italian grille & bar,\n115 S. Field street,\nDallas TX 75202,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n\n,\n,\n,US Transport,"
  },
  {
    "desc": ",\nHiring immediately! New York style pizzeria is hiring delivery drivers. Must have vehicle and auto insurance. Call or text your interest for hours and pay. Perfect summer job but position is available year round.,"
  },
  {
    "desc": ",\nTRUCK RELOCATING SERVICES,\n,\nCDL Qualifications,\n*23-70 years of age,\n*If over 70 years of age, a DOT Medical statement is required from physician.,\n*Valid Drivers License 2 years,\n*2 Week runs at a time with flexible home time,\n,\nNON CDL Qualifications,\n*21-70 years of age,\n*If over 70 DOT Medical Statement is required from physician.,\n,\nFull Job Description - Truck Relocating Services drivers are Independent Contractors and have the freedom to operate on their own schedule. 7-10 regional run with flexible home time.,\nYou choose the type of loads you deliver. You won't have the expense of your own truck.,\n,\n*No Forced Dispatch,\n*No Truck Ownership,\n*Driver Support,\n*Weekly Pay,\n*Flexible Home Time,\n,\nBonus Opportunities -Referral, Safety, Clean DOT Inspection, Mileage and Time on the road bonus.,\n,\nWWW.TRSMOVES.COM or call 480-494-2913"
  },
  {
    "desc": ",\nDENTON: HIRING ROUGH CARPENTERS! START ASAP! WEEKLY PAY!! (DENTON),\n,\nWe are currently looking for Experienced Framing Carpenters for our large construction site in Denton.,\n,\n*Previous experience required*.,\n*Must have your own tools* ---Tools may consist of: Circular Saw, Drill, Hammer, Putty Knives, Sheetrock knife, Tap measure, Level, and other miscellaneous tools.,\n,\nPay= $19.00-$20.00 hr (1.5 X Overtime),\n,\nJob duties will consist of:,\n- Wood & Metal framing,\n- Light Carpentry,\n- Touch up Paint,\n- Drywall (float, tape, texture),\n- Trim Adjustment/ Repair,\n- Appliance Install,\n,\nJob Requirements:,\n- Reliable Transportation,\n- Must have your own tools,\n- Two forms of identification,\n,\nPlease reply to the ad with your name and contact information.,\n,\nThank you!,\no\tPrincipals only. Recruiters, please don't contact this job poster.,\no\tdo NOT contact us with unsolicited services or offers,\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n\n,\n\n,\n,"
  },
  {
    "desc": ",\nThis position is primarily responsible for selling profitable installation jobs.  Oversee jobs through scheduling, completion, collection, and referral.  Meet or exceed budgeted monthly sales.  Closing rate targets should be 70% for existing customers and 40% for new prospects.  A blended closing percentage should be above 67% with an ever-increasing average sale.,\nMinimum Qualifications:,\n•\tHVAC/R experience a must,\n•\t3+ years previous Sales experience,\n•\tHigh School Diploma or GED,\n•\tBasic computer application skills,\n•\tValid Driver's license and reliable transportation,\n•\tWell-groomed, drug-free, and dependable,\n•\tAvailable to work some evenings and some Saturdays to accommodate customer's schedule,\nCompetencies required:,\n•\tExtraordinary Customer Service skills,\n•\tStrong attention to detail and follow-up skills,\n•\tPolished presentation skills,\n•\tExceptional negotiation & closing skills,\n•\tAbility to multi-task handling multiple customers at one time,\n•\tLead management experience,\n•\tExcellent planning and organization skills,\nCharacteristics desired:,\n•\tSelf-motivated, energetic, confident and strong work ethic,\n•\tAttitude for success,\n•\tHigh Ethical Standards,\n•\tStrong self confidence,\n•\tAbility and willingness to learn and be a part of a team,\nEssential duties and responsibilities:,\n1.    Happily involve customers in new comfort systems.,\n2.    Execute sales presentations as outlined in Master Tech Service Corp.’s sales procedures, building the value greater than the customer's investment.,\n3.    Maintain a professional attitude and appearance at all times.,\n4.    Always do what is best for the customer and remember the Company and your reputation are at stake.  Exhibit the utmost in integrity at all times.,\n5.    Customer Interaction:,\n1.    Assist customers to achieve healthy, comfortable, safe environments by asking \"layering\" questions to find out what their needs are.,\n2.    Obtain customer authorized agreement for all jobs over $1,000.,\n3.    Complete proposals and price jobs to our customers within the guidelines set forth by the Sales Manager and Company standards.,\n4.    Offer third party payment programs and follow through to verification of approval and proper paperwork.,\n5.    Actively pursue referrals from satisfied customers.,\n6.    Visit most of the jobs sold within one week of installation to assure quality, answer customer questions, collect and ask for referrals.,\n6.    Job Management:,\n1.    Ensure profitability of the department by accurately proposing all jobs, using book pricing, with the emphasis on quality and value.,\n2.    Review with Sales Manager or Installation Manager all jobs scheduled for duration longer than 5 days or over the amount of $15,000.,\n3.    Communicate with our support staff, in a timely and efficient manner details of jobs, financing and job scheduling.,\n4.    Submit via email the job packet with the sheet metal form in a timely fashion and describe in detail specifications to finish the job in the time allotted.,\n5.    Communicate to Installers the job requirements and expectations of the customer through verbal communication, pictures, drawings, and written forms.,\n6.    Maintain contact with Installers and customers during installation to ensure a quality system is installed.,\n7.    Growth Opportunities:,\n1.    Prospect for new customers by outbound calling or door-to-door 5 hours each week to increase customer base and personal income.,\n2.    Have a written business plan for each week, month and year.,\n3.    Accept On-Call duties in a rotation basis with other comfort consultants.,\n4.    Attend and participate in regular scheduled sales meetings, as well as special sales training opportunities as they arise.,\n5.    Any and all other duties as requested or assigned.,\n,\nPLEASE CONTACT ANASTACIA AT 817-251-4455 EXT 309 IF INTERESTED,"
  },
  {
    "desc": ",\nSimply Fondue Dallas is looking for a couple dishwashers. ,\nShifts start from 4-5:00PM and run until close.,\nCommercial dishwashing experience a plus but not needed.,\nFull time AND weekend only available!!!,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nTired of 2nd shift? Growing national printing and mailing company is seeking a rotary web press operator(s). This is a M-F position with occasional overtime. Top pay for top performance. Harris or Didde web experience a plus. Must have good math skills, speak and understand english and ability to work with others. This is a full-time position - company offers good benefits package, pleasant atmosphere and opportunity for growth. Highly competitive starting hourly rate of pay. Apply in person at: CFC Print & Mail, 2800 113th Street, Suite 300, Grand Prairie, TX 75050. Ask specifically for Danny when applying. No information will be provided via phone or e-mail.,"
  },
  {
    "desc": ",\nAlden Energy Consulting is…  ,\na full-service, independent energy consultancy and brokerage firm. We are focused on saving our clients’ money through enhanced procurement methods and energy conservation projects. We are a registered aggregator and electricity broker with the Public Utility Commission of Texas, as well as an ERCOT IMRE market participant. ,\n,\n,\nOur Research Analyst and Office Coordinator will… ,\nbe resourceful, hardworking and a self-starter, who enjoys paying attention to the details. This role is a great fit for an analytical, technically focused, self-starter who possesses a whatever-it-takes attitude. They must be able to multitask with a high level of attention to detail with minimal supervision and direction.  ,\n,\n,\nKey Responsibilities: ,\nValidating and analyzing customer usage data to verify proper data input,\nOperating, updating and modifying Excel based pricing models to ensure accurate results,\nOffice management assistance including scheduling, event planning, reception and other responsibilities,\nEnsuring that various pricing structures are properly understood and reflected in comparative analyses,\nA basic understanding of the cost structures of deregulated electric and natural gas markets,\nStaying on top of energy market news and updates,\nUtilizing a customer relationship database - Salesforce.com,\nHaving the ability to step in and assist with other projects as needed,\n,\n,\nRequirements: ,\nBachelor’s degree - highly preferred,\nProficiency in Microsoft Office Suite - Excel is a must,\nSalesforce.com experience - highly preferred,\nResults-oriented, positive, friendly, technically focused with an upbeat attitude,\nExcellent written, verbal and organizational skills,\nDetail orientation mindset,\n ,\n,\nWhy Work at Alden Energy Consulting?,\nWe offer a competitive base starting salary ($34k - $40k DOE), plus other activity and closed deal revenue commission, as well as occasional bonus opportunities,\n2 weeks of initial full-time, one on one paid training, followed by continued mentorship and support,\nClear goals, with limited overall oversight,\nTechnology/hardware supplied,\nAn opportunity to make a daily impact in a small firm environment,\n,\n,\nAlden Energy Consulting offers a comprehensive benefits package, including medical/dental/vision, 401K with company match, and a generous PTO policy.,\n,\n,\n,\n,\n,\nAlden Energy Consulting is an Equal Opportunity Employer,"
  },
  {
    "desc": ",\nUse Your Economy Car for Local Auto Parts Deliveries $650 Per Week,\n,\nIn addition, with fuel costs rising we add an additional 8% per day. This rate is subject to change,\n,\nWEEKLY CONTRACT; MUST COMPLETE ENTIRE WEEKLY CONTRACT FOR PAYMENT,\n,\nM-F 40 Hours / Week. Easy Local Routes AVAILABLE NOW!! 100-125 Miles Per Day,\n,\nExpect to spend $15-20 a day in gas depending on your vehicle gas consumption.,\n,\n,\nWEEKLY DIRECT DEPOSITS,\n,\n1099 Contract Opportunity - No Taxes Taken Out,\n,\nPaid Weekly Every Monday via Direct Deposit,\n,\nMust Be Able To Pass National Background Check,\n,\nSpecific Requirements:,\n,\n* Must:,\n,\n~Have Reliable vehicle to get to work every day,\n,\n~Be available to start work immediately,\n,\n~Have a great personality and positive attitude,\n,\n~Like a 40 hour week,\n,\n~Be able to pass a background check,\n,\nBefore responding to this ad, make sure you can answer \"YES\" to all of the above!,\n,\n,\nIf interested please contact Crystal at (214) 440-1923,\n,\nOR: Complete this Jot Form and a recruiter will contact you soon:,\n,\n,\n,"
  },
  {
    "desc": ",\nUse Your Economy Car for Local Auto Parts Deliveries $650 Per Week,\n,\nIn addition, with fuel costs rising we add an additional 8% per day. This rate is subject to change,\n,\nWEEKLY CONTRACT; MUST COMPLETE ENTIRE WEEKLY CONTRACT FOR PAYMENT,\n,\nM-F 40 Hours / Week. Easy Local Routes AVAILABLE NOW!! 100-125 Miles Per Day,\n,\nExpect to spend $15-20 a day in gas depending on your vehicle gas consumption.,\n,\n,\nWEEKLY DIRECT DEPOSITS,\n,\n1099 Contract Opportunity - No Taxes Taken Out,\n,\nPaid Weekly Every Monday via Direct Deposit,\n,\nMust Be Able To Pass National Background Check,\n,\nSpecific Requirements:,\n,\n* Must:,\n,\n~Have Reliable vehicle to get to work every day,\n,\n~Be available to start work immediately,\n,\n~Have a great personality and positive attitude,\n,\n~Like a 40 hour week,\n,\n~Be able to pass a background check,\n,\nBefore responding to this ad, make sure you can answer \"YES\" to all of the above!,\n,\n,\nIf interested please contact Crystal at (214) 440-1923,\n,\nOR: Complete this Jot Form and a recruiter will contact you soon:,\n,\n,\n,"
  },
  {
    "desc": ",\nFind out why the Dallas Morning News named us as one of the Top 150 Employers in DFW for two years in a row! LUMA Residential was also just celebrated as one of the Top 22 companies in 2022 in Commercial Real Estate by GlobeSt. Real Estate Forum.,\n,\nAre you a Leasing Consultant with a strong closing ratio and outgoing personality? Would you like to continue your career path in Property Management with a company that provides excellent benefits and cares about YOU! Then, please consider a position with LUMA Residential., a leader in the multi-family industry!,\n,\nYou can even move on site your first day with the 40% rent discount! (Not required to live on site, just a PERK!).,\n,\nThe Leasing Professional is to effectively follow the leasing and marketing program within the guidelines and operating objectives. The leasing agent has the authority and responsibility to perform the functions and tasks set forth below:,\n,\n* Screen all incoming residents by qualification standards,\n,\n* Achieve 33% conversion of clients to residents,\n,\n* Maintain professional appearance of self and leasing office,\n,\n* Contribute new ideas, solutions, and participate in brainstorming with staff,\n,\n* Conduct off-site marketing and assist in preparing marketing plans,\n,\n* Assist with resident programs and retention,\n,\nPreferred Qualifications:,\n,\n,\n* High school diploma,\n* Good presentation skills and a team player,\n* Exhibit exemplary hygiene and appearance,\n* Typing speed of 40 WPM,\n* Cheerful and professional attitude,\n,\nMay apply in person at Paces Crossing Apartments in Denton,\n,\n,\n,\n**We are also hiring for a Summer Porter position at Paces Crossing (from June through August, $14 hourly).  No experience required!***,\n,\n,"
  },
  {
    "desc": ",\nRicchi Group is looking for Bilingual Administrative Assistant. We offer health/dental benefits, paid vacation, and sick days.,\n,\nBilingual applicants with previous experience in commercial real estate are preferred.,\n,\nAccounts Receivable Specialist Duties and Responsibilities,\n,\n-Review invoices for accuracy,\n-Reconcile Accounts ,\n-Send invoices to customers and clients,\n-Process payments,\n-Resolve disputed charges,\n-Set up new accounts,\n-Maintain customer files and record payment information,\n-Data Entry,\n-Creating financial reports,\n,\n,\nAccounts Receivable Specialist Requirements and Qualifications,\n,\n-High school diploma or GED certificate,\n-RealPage Onesite experience preferred,\n-Proficiency in Microsoft Word, Excel, and Outlook,\n-Previous experience in accounts receivable,\n-Bilingual preferred,\n-Communication skills ,\n-Customer service skills,\n-Teamwork,"
  },
  {
    "desc": ",\nRicchi Group is looking for Bilingual Administrative Assistant. We offer health/dental benefits, paid vacation, and sick days.,\n,\nBilingual applicants with previous experience in commercial real estate are preferred.,\n,\nAccounts Receivable Specialist Duties and Responsibilities,\n,\n-Review invoices for accuracy,\n-Reconcile Accounts ,\n-Send invoices to customers and clients,\n-Process payments,\n-Resolve disputed charges,\n-Set up new accounts,\n-Maintain customer files and record payment information,\n-Data Entry,\n-Creating financial reports,\n,\n,\nAccounts Receivable Specialist Requirements and Qualifications,\n,\n-High school diploma or GED certificate,\n-RealPage Onesite experience preferred,\n-Proficiency in Microsoft Word, Excel, and Outlook,\n-Previous experience in accounts receivable,\n-Bilingual preferred,\n-Communication skills ,\n-Customer service skills,\n-Teamwork,"
  },
  {
    "desc": ",\nTristar Logistics is looking for CDL drivers with a minimum of 2 years experience. Good driving record. Based out of Austin // Dallas // Houston TX area. Possible to be at home during the weekends if needed.,\n,\n,\n-Dry Van 0.65 CPM,\n-Miles per Odometer,\n-Consistent home time,\n-Weekly payment,\n-3000 miles per week,\nSe habla español!!!,\n,"
  },
  {
    "desc": ",\nReputable HVAC & Plumbing company seeking experienced HVAC service/sales tech for the N. Dallas area. We do not do any new construction or commercial work, just existing residential.  We have twice been nominated for Best Places to Work by The Dallas Business Journal, we are the 2019 Oncor Best of the Best Award winner, and we were a Top 3 Finalist for the BBB Torch Award for Ethics.  Our Core Values are Integrity, Accountability, and Customer Commitment, and we hold firm to those Values and practice them daily.,\n,\nWe will offer: Top notch pay ($25+ based hourly)  commission on ALL sales. We also offer take-home wrapped trucks, company iPhone, reclaim machine & vacuum pump, uniforms, gas cards, and daily schedule via Dispatch.me, sales materials and hand-outs, contests/spiffs/bonuses, and health, vision, and dental benefits.,\n,\nWe expect: 1-3 years minimum field experience, good driving record, sales driven, reliable, all hand tools to perform jobs (including torches), and TDLR licensed. Will substitute experience for proven strong performance in sales.,\n,\nPlease respond with your name, phone number, email, salary requirements, and resume (if you have one).  Serious inquiries only, as we will ONLY consider applicants with our needed requirements.  If you are looking to make a change, and the best money you've ever made doing HVAC, then please contact us.  We will be setting up phone interviews, which hopefully lead to face-to-face interviews, which lead to hiring.  Once hired, paid training will begin immediately at our corporate office here in Dallas, then riding with team lead for a period of time that is TBD based on skill.,\n,\nplease contact Anastacia at 817-251-4455 ext 309 if interested,"
  },
  {
    "desc": ",\nD&L Entertainment Services, Inc. - ,\n,\nHiring Full/Part -Time Level 2 - Security position near in Garland Texas,\n,\nHiring for these positions; Sunday, Monday, Tuesday & Wednesday 9:30 am to 9:00 pm.,\n,\n,\nRequest to speak with John or Kyile and leave a message if not available. ,\n,\n,\n,\nQualifications for candidacy:,\n,\n•\tMust be 18 years or older.,\n•\tProfessional appearance and demeanor.,\n•\tMust pass a criminal background check.,\n•\tMust be willing to participate in the company's pre-employment screening process.,\n•\tMust have a valid Driver's License.,\n•\tFormer Military or Law Enforcement experience a plus.,\n,\nFor immediate consideration, please apply online: ,\n,\n,\nOr visit our office, Mon - Fri (between 9am and 3pm):,\n,\nD&L Entertainment Services, Inc. - Security Division.,\n4120 Main St.,\nDallas, TX 75226,\n(214) 634-0757,\n,\nTX Lic. #C-02237,"
  },
  {
    "desc": ",\nWe are looking for a trailer mechanic to join our team! You will be responsible for refurbishing trailers, dry vans & car haulers.,\n,\nResponsibilities:,\nChange tires,\nBrakes,\nHubs,\nAir Hoses ,\nMinor Hydraulics,\nMiscellaneous ,\n,\nQualifications: ,\nPrevious experience as a trailer mechanic,\nDeadline and detail-oriented,\nAbility to thrive in a fast-paced environment,\nSelf Motivated,\nIndependent,\nFlexible ,\n,\nJob Type: Part-Time,\n,\nBackground check required (must not include sexual assaults, all other felonies or misdemeanours will be determined on a case by case basis),\nDrug test required (cannabis excluded),\n,\nMust be able to lift 100lbs,\nMust have reliable transportation"
  },
  {
    "desc": ",\nWe are a Horizontal Directional Drilling Company based out of Bismarck. We are looking for additional employees. We work mainly in Western ND and Eastern MT, which will require overnight travel. We do provide housing along with $75/night per diem for overnight stays away from our base in Bismarck. We also pay drive time and provide transportation. This job requires overtime with hours ranging from 50-70+ hrs per week. Time and a half is paid for over 40 hours. CDL holders will receive a $3/hr bonus. Insurable driving record is required as well as a pre-employment drug screen.,\n,\nMedical and Dental benefits offered for FT employees. Simple IRA Retirement with a 3% match is also offered.,\n,\nKnowledge of construction equipment is helpful, but we are willing to train the right candidates. A CDL is not required for the job, but helpful.,\n,\nWages depend on experience $21 - $30/hr.,\n,\nMust be 18. This is year round work. Work can take you out of town for 2-3 weeks at a time.,\n,\nIf interested please go online to www.dlcnd.com and fill out an employment application or ,\ncontact or text Art Dodd at 1-786-647-0565,"
  },
  {
    "desc": ",\nROUTE #1 - Inter-office Mail:,\nShift: (M - F) (8:30a - 9:30a),\n,\nTakes an hour or less to complete but must be completed by 9:30a!!!,\n,\nPU mail in lockboxes for 14 medium bags @ post office on Trinity Mills/N. Dls Tollway (Addison). Take to the business mailroom 5 mins away on Spring Valley/N. Dls Tollway...that's all!,\n,\n1 Ride Along: Fri. July 1,\nStarts: Tue. July 5th,\n$65wk...paid weekly!,\n,\n,\nROUTE #3 - Dental Offices,\nShift: (M - F) (1p - 4p),\n,\nStart/Finish Location: (Plano) This route delivers/PU small bags for dental offices in the Plano, Allen, Frisco & Mckinney area.,\n,\n1 Ride Along: ,\nMon Jun 27/28 or July 1st,\nStarts: Tue July 5th,\n$275+ (depends on amount of stops p/day),\n,"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Water Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact John with resume: Email: jmaloney@leafhomewatersolutions.com at C: ,\n973-460-5376,"
  },
  {
    "desc": ",\nWe are seeking to add a highly motivated and energetic warehouse associate for a full time position! We have a great team to work with! ,\n,\nFull-Time, Monday - Friday 7:00am-4:00pm, must be open to working Saturdays occasionally if needed, but paid overtime for anything over 40 hours.,\n,\n$15hr - $16hr depending on experience.,\n,\n,\nWarehouse Associate Duties and Responsibilities:,\n,\n- Ensuring that our product is moved within our warehouse in a safe and efficient manner,\n,\n- Maintaining accurate inventory of material,\n,\n- Making sure good house keeping and warehouse standards are upheld,\n,\n- Sorting and pulling customers orders,\n,\n- Unloading inventory,\n,\n- Maintaining organization in the warehouse at all times,\n,\n,\n,\nWarehouse Associate job qualifications and requirements:,\n,\n- Candidate must be punctual and have a sense of urgency,\n,\n- Attention to detail and work well with others,\n,\n- Must be able to lift 50lbs - THIS IS A MUST!,\n,\n- Forklift Experience a Plus!!,\n,\n- Some Saturday hours when requested,\n,\n- MUST BE RELIABLE and come to work when scheduled,\n,\n- Must have reliable transportation to get to work,\n,\n- No violent criminal history, no theft felonies, and no other serious criminal past,\n,\n,\nBenefits:,\n,\nHealth Insurance,\nDental insurance,\nVision Insurance,\nLife insurance,\n401(k),\nPaid time off,\n,\n,\n#warehouse,"
  },
  {
    "desc": ",\n,     3900 W Northwest Highway\n               Dallas, TX 75220\n<p\n,< For this property, YES, but there are other properties available if you do not have a pickup truck.\n,\n,"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Water Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact John with resume: Email: jmaloney@leafhomewatersolutions.com at C: ,\n973-460-5376,"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Water Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact John with resume: Email: jmaloney@leafhomewatersolutions.com at C: ,\n973-460-5376,"
  },
  {
    "desc": ",\n,\n\t\n\t,\n\n\n\t,\n\t\t,\n\n\n\t,\n\n\t,\n\n\n\n\t,\n\n\n\n\n\t,\n\n\t,"
  },
  {
    "desc": ",\nOperating since 1984 and still growing! We work hard to keep our drivers happy!!,\n,\n** 25% - 28% OF REVENUE **,\n**$2,000 SING ON BONUS**,\n* ELD AND PAPER LOG TRUCKS AVAILABLE*,\n* AUTOMATICS AND MANUALS AVAILABLE*,\n* NEW AND CLEAN EQUIPMENT*,\n* HEALTH, VISION, AND DENTAL BENEFITS! *,\n* PAID WEEKLY! CURRENT DRIVERS ARE BRINGING HOME $2500 TO $3500 A WEEK!! (on average this equates to 93 cents per mile)*,\n* HOME WEEKENDS! DRIVERS LEAVE SUNDAY AND RETURN ON FRIDAY*,\n* FUEL CARDS*,\n* IN-HOUSE MAINTENANCE CREW*,\n* TIRE INFLATION AND ROUTINE MAINTENANCE EVERY WEEKEND*,\n* TRUCKS CLEANED EVERY WEEKEND*,\n* PASSENGER PROGRAM AND PET POLICY*,\n,\n****MOST OF OUR DRIVERS MAKE OVER $100,000 A YEAR!****,\n,\nAs a family owned company, we care about keeping our drivers happy. That means great communication and understanding, weekly pay, and home every weekend. We have an in-house maintenance crew to provide both routine maintenance and immediate action on repairs if needed. Automatic ELD's available! APPLY HERE: ,\n,\nDriver Qualifications Include:,\n Valid Class A CDL REQUIRED ,\n• Minimum 23 years of age ,\n• Minimum two-year recent and verifiable flatbed (including tarping) experience ,\n• Clean driving and safety record ,\n• Maintain required productivity standards and exceptional customer service ,\n• Must adhere to all safety requirements and work procedures ,\n• Ability to perform physical requirements of the job ,\n• Ability to work in all weather conditions ,\n• Successfully pass a road test, DOT physical, drug screen, and background check ,\n• Previous oversize hauling is preferred ,\n• No hours-of-service violations preferred ,\n,\nHiring Requirements:,\nNo more than 3 tickets in the last 3 years,\nNo DWI/DUI convictions in the past 5 years,\nMust have experience operating ELD device,\nClass A Commercial Driver's License,\nAbility to follow instructions and complete regular training,\n,\nYou can check us out at www.cowtownexpress.com. Family owned and operated since 1984.,\nCome and join our family!,\n,\nCall 817-590-8686 / 682-348-5820 during normal business hours or text Lawrence at 214-609-8562,\n,\nAPPLY HERE!,\n,\n,\nLooking for drivers ASAP so call for an interview today! We will get you driving same week!,"
  },
  {
    "desc": ",\nFind out why the Dallas Morning News nominated us as one of the Top 150 DFW Employers for two years in a row! LUMA Residential was also just celebrated as one of the Top 22 companies in 2022 in Commercial Real Estate by GlobeSt. Real Estate Forum.,\n,\nYou can also move on site to your first day with the 40% rent discount (not required, just a PERK),\n,\nA leader in multi-family property management is seeking an enthusiastic real estate professional who shares our vision of excellence and customer service. We currently have an Assistant Manager opportunity for someone interested in a career -- not just a job. This is a great opportunity for someone looking for training, education and growth in the apartment industry. We also offer excellent benefits included subsidized insurance, paid vacation and time off, 401k, 40% rent discount and many more!,\n,\n**Experienced candidates only,\n,\nThe Assistant Manager primarily operates and manages the receivables of the property accounting, maintains unit files, and assists in daily operations of the property:,\n,\n* Collection and posting of all rent and daily deposits,\n,\n* Close out accounting and complete occupancy month end,\n,\n* Read and speak English,\n,\n* Achieve under 2% delinquent each month,\n,\n* Assist in leasing and marketing,\n,\n* Assist Property Manager,\n,\n* Represent Property Manager during periods of absence,\n,"
  },
  {
    "desc": ",\n,\n\t\n\t,\n\n\n\t,\n\t\t,\n\n\n\t,\n\n\t,\n\n\n\n\t,\n\n\n\n\n\t,\n\n\t,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,"
  },
  {
    "desc": ",\nRon Perrin Water Technologies, Inc. is currently seeking a candidate for Tank Inspector and tank cleaner. We also have an opening for a commercial diver.  We are based in Fort Worth, Texas. We work in 10 states with 90% of our work being in the State of Texas. ,\n,\nWe are currently seeking a person experienced with Water Tanks, Water tank cleaning, and Confined Space Entry Procedures to inspect and clean water tanks. ,\n,\nNOTICE:  IF YOU CAN CLIMB WE WILL TRAIN.  See: www.tankdiver.us,\n,\nInspection training may be provided to the right individual. Out-of-town travel is required (typically 3-4 days per week). All out-of-town travel is paid for by the company.,\n,\nThis is a non-diving position, fall protection, and confined space training are required and may be provided for the right individual. Rapid advancement to crew chief possible for the right individual. ,\nEntry pay depends on training and experience. ,\n,\nWE ALSO HAVE A DIVER OPENING, we are looking for an Entry Level Diver,\nDO YOU HAVE WHAT IT TAKES - Diver Certification is required for this position.,\n,\nCompany Profile:,\nWe are a leading company in the field of Potable Water Storage Tank Inspections and cleaning. Established in 1997, Ron Perrin Water Technologies has solid experience as the leader in this field with many of our clients have been customers for over 24 years. We use underwater video cameras, remotely operated underwater vehicles, and commercial divers, when needed, to inspect and clean water tanks and towers. See our new website at , ,\n,\nThe new position will inspect water tanks and towers across Texas and in several other states. Assist with cleaning services while also promoting the best practices in safety. OSHA training certifications such as Confined Space Entry, Fall Protection are highly valued in this position. ,\n,\nOur expertise is built on training combined with practical field experience and safety compliance. Our inspection and cleaning methods have saved tens of millions of gallons of treated drinking water and improved the water quality for hundreds of water systems.,\n,\nResponsibilities will include, but are not limited to, the following:,\n,\n•\tInspect water tanks and towers with a remote underwater camera Daily.,\n        Assist with remotely operated vehicle inspections (ROV) and diver inspections. ,\n        Perform or assist on dry inspections and out-of-service tank cleaning.,\n•\tUnderstand OSHA safety regulations on fall protection and confined space.,\n•\tBecome knowledgeable of Ron Perrin Water Technologies inspection procedures, industry terminology, and ,\n        company operations.,\n•\tProvide support and service to existing accounts in the service area.,\n•\tWork independently out of the office after training. Duties and functions as deemed necessary.,\n•\tLearn ROV inspection and cleaning procedures ,\n•\tComplete other duties as assigned.,\n,\nQualifications:,\n,\n•\tAbility to climb 160ft ladders, lift 50 pounds and work outdoors daily.,\n•\tAbility to drive a manual transmission vehicle.,\n•\tExcellent interpersonal skills and team player able to work for an established family-owned company. ,\n•\tEnergetic, motivated self-starter ,\n•      Travel is required. Must have a valid Driver's License. Pass pre-employment drug screen.,\n•\tBasic mathematical skills including the ability to add, subtract, and multiply.,\n*     ,\n,\n,\nJob Type: Full-time, w-2 employee ,\n,\nRequired experience:,\n,\n• 1 year working at height, confined space entry, tank work, or water utility experience.,\n  Currently interviewing for NON-DIVING Inspector (we currently have a different position open for a diver).,\n,\nWe work in many federal prisons, this requires us to maintain a crew with a clean background.,\n,\nNo felonies and no class A misdemeanors.  We drive all over Texas, a good driving history is also required.,\n,\nThis is a DRUG-FREE company. Pre-employment and random drug screens are required.  ,\n,\nIf you meet these qualifications we would love to speak with you more about this opportunity.,\n,\nPlease call 817-377-4899 to schedule an interview, do not text. ,\n,\nDownload an application here: ,\n,\nDo you meet our qualifications?,\nIF YOU CAN CLIMB WE WILL TRAIN.  See: www.tankdiver.us,"
  },
  {
    "desc": ",\n$1000 Hiring Bonus to be paid on first paycheck!,\n,\nFind out why the Dallas Morning News nominated us as one of the Top 150 DFW Employers for two years in a row! LUMA Residential was also just celebrated as one of the Top 22 companies in 2022 in Commercial Real Estate by GlobeSt. Real Estate Forum.,\n,\nYou can move on site your first day with the 40% rent discount off any apartment! (Not required to live on site, just a perk!),\n,\nWe are seeking an experienced Service Tech (Asst. Maintenance) for our apartment community. This is not just a job but the chance for a long term career! We offer training in any other areas that you are interested, including training for promotion to a Maintenance Supervisor position. We also offer excellent benefits included subsidized insurance, paid vacation and time off, 401k, 40% rent discount and many more!,\n,\nThe Service Technician is to keep the property maintained and operating 24 hours a day; to implement and follow LUMA Residential service programs, policies and procedures, including a monthly preventive maintenance program and inventory control log; must be able to assist in supervising the other maintenance staff and FOLLOW safe work habits.,\n,\nService Technician has authority and responsibility to perform the functions and tasks set forth in the following.,\n,\n* Able to perform all maintenance requests, including A/C and appliance within 3 days,\n,\n* Perform preventive maintenance and possible scheduling,\n,\n* Make ready of vacant units, may include painting and carpet cleaning,\n,\n* Assist Service Manager, if available, whenever needed,\n,\n* Maintain a professional appearance,\n,\n* Available for rotating call,\n,\n,\nPreferred Qualifications,\n,\n* 2 years experience in full-time apartment maintenance,\n,\n* ability to communicate verbally and written with good English skills,\n,\n* own tools to perform the job,\n,\n* willing to contribute in other areas, i.e., cleaning grounds, painting, etc.,\n,\n* maintenance training and have current CFC certifications and pool operators license,\n,\nCandidates may also apply in person at Knox at Allen Station Apartments in Allen"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nResponsibilities:,\n,\nInstall new heating, ventilation, and air conditioning systems or only,\nInspect and perform equipment repairs and replacements,\nPerform routine preventative maintenance,\nRespond to emergency maintenance requests,\nAdhere to all safety policies and procedures,\n,\nQualifications:,\n,\nMinimum two years of HVAC tech experience,\nFamiliarity with HVAC wiring diagrams,\nAbility to handle physical workload,\nStrong problem solving and critical thinking skills"
  },
  {
    "desc": ",\n,\n,"
  },
  {
    "desc": ",\nHIRING IMMEDIATLEY!!!  SIGN ON BONUS!!!!,\nWe have immediate openings for drivers in our flatbed and dry van divisions.,\nWe also have immediate opportunities for owner operators in our Flatbed, Frac Sand, and Dry Van divisions.,\nDrivers Paid 30% of Truck Gross,\nPerformances Bonuses for Drivers,\nOwner Ops Paid 82% of Truck Gross,\nAverage Truck Gross $9,000-$12000,\nFuel Cards ,\nAsk about free trailer rent,\n21 – 7 Schedule for all divisions (exceptions can be made on a case-by-case basis)"
  },
  {
    "desc": ",\nWe have an open position for an experienced CNC Machinist ,\nMust be able to set up ad operate a CNC Lathe.,\nminimum 2 years of CNC experience, or certificate of vocational CNC operator education.,\nExperience working within a manufacturing environment,\nAble to complete assignments with attention to detail and high degree of accuracy,\nAble to work independently with minimal guidance and as part of a team,\nAbility to communicate professionally and effectively to management, peers, and subordinates.,\nHighly detailed.,\nExcellent hand skills,\nWilling to work flexible hours and over time.,\nGood mechanical aptitude,\nAbility to use production tools such as: power drills, pneumatic sanders, surface grinders, angle grinders, pencil grinders, and basic hand tools.,\n   **Apply with resume to company website at Sawyer Composite.com"
  },
  {
    "desc": ",\nPotable WATER TANK DIVER WANTED,\n,\nWe are looking for a commercial diver.  Good driving records are required.,\n,\nMilitary or Line Air Dive Training is Required. Commercial Diver Experience is preferred.,\nFall protection and confined space training are required and may be provided free of charge for the right individual. CURRENT SCUBA, CPR Certification, and recent diving physical are required, preference is given to ADCI Certified Diver.  Top PAY for experienced Water TANK and TOWER DIVER. E-mail resume and salary history.,\n,\nKey Responsibilities:,\nWork underwater and above water with a Dive Team of  3 – 4 commercially certified divers. Efficiently and effectively perform water tank and tower inspections and the,\n,\nremoval of tank sediment from the floor of water storage tanks.  Must be able to climb 100-200 foot ladders. Must be fit and able to carry gear bags up to 80 pounds.,\nWorking Conditions:,\nLove of working outdoors is essential and the willingness to work in bad weather conditions.  (i.e. rain, high humidity and heat),\nRequired to work a minimum of 35 hours per week for FT position.,\nAble to work occasional weekends and overtime as needed.,\n,\nQualifications:,\n– Healthy physical status, current dive physical required.,\n,\n– Line air training, Scuba Certification, fall protection, and confined space training are required (we can help with fall protection and confined space training if you do not have it already).,\n,\nEmployment is year-round. Pay based on experience. Pre-employment drug screening is required. This position requires frequent out-of-town travel, paid by the company (from Fort Worth, Texas). Please e-mail resume and use “Resume” on the subject line.  See: ,\n,\nCall 817-377-4899 to schedule an interview M-F 8 to 5.  The phone is Voice only do not text!,\n,\nFor more information see: www.tankdiver.us,\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nRequired: Ability to read, interpret, and follow all our customer’s and internal drawings, prints, and work instructions,\n• Perform tool preparation (sealing and releasing tools) and de-mold of cured parts.,\n• Ability to use measuring devices such as a scale, micrometer, calipers for lay-up and in process inspection,\n• Use hand tools safely such as a utility knife, xacto blade, scissors, and heat gun,\n• Ability to create templates for cutting kits, or cut kits with specific dimensions,\n• Ability to work with different types of materials such as adhesives, fiberglass (dry or pre-preg), and uni-directional tape.,\n• Lay-up non to medium complex geometry parts,\n• Familiar with de-bulk and final bagging systems,\n• Maintain a clean and safe work area,\n• Ability to demonstrate safe work habits and to wear required protective equipment at all times as required,\n• Ability to work with hands in conjunction with hand/eye coordination,\n• Ability to sit and/or stand stationary for several hours,\n  Qualifications:,\n• Education (High School Diploma or GED),\n• 1 - 3 year(s) of composite manufacturing or repair experience preferred,\n• Experience working within a manufacturing environment,\nKNOWLEDGE, SKILLS, ABILITIES:,\n• Highly detailed; excellent hand skills; team player; Willing to work flexible hours and over time"
  },
  {
    "desc": ",\nExperiencia en remodelacion interior de apartamentos (make-ready). Con herramienta. ,\nRemodeling in apartments. Must have your own tools. ,\nPaint, patch, install baseboard, etc."
  },
  {
    "desc": ",\n,Due to increased freight volumes V3 Transportation is looking to add Independent Contractors to our fleet of Class B Straight Trucks.,\n,\nWe are looking for Straight Truck Teams willing to drive across the country delivering freight to V3 customers.  Most successful teams are out 2 to 4 weeks at a time.  This is an OTR (Over The Road) position and we have newer model Expedite Straight Trucks available.\n,\nCall us at , or email , for more information.,\n,\nTO APPLY:  ,\n,\n,V3 Transportation LLC,"
  },
  {
    "desc": ",\nLocal Trucking Driving Positions Available,\n,\nLocally Owned Trucking Company is looking for experienced Truck Drivers in the Fast Paced Construction Industry.,\n,\nDuties include safely driving and delivering construction materials to construction projects across the DFW metropolitan area,\n,\nDrivers Must Posses the Following:,\n,\nValid CDL, Class A or B,\nBe At least 25 years of age,\n2 Years verifiable driving experience,\nReliable,\nClean Driving Record- No DUI's or DWI's in the last 3 years,\n,\nNew Equipment 2018 to through 2021 Peterbilts,\nOvertime after 40 hours,\nDirect Deposit,\nHealth, Dental, Life and Vision Insurance,\nPaid Vacation and Holidays,\nMultiple shifts available and Times,\n$25.00 per Hour to Start,\n,\nIf interested in positions available please contact us at 832-725-6516,"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Safety Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact Lauren with resume: Email: lbozik@leafhomesafetysolutions.com at C: 440-321-0441"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Safety Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact Lauren with resume: Email: lbozik@leafhomesafetysolutions.com at C: 440-321-0441"
  },
  {
    "desc": ",\nDo you have in-home sales experience?,\nAre you looking to make significant financial gains?,\nAre you a CLOSER?!,\n,\nLeaf Home Safety Solutions, a division of Leaf Home, is looking for Sales Representatives in your area to meet with prequalified and quality customer sales leads.,\n→ Scheduled appointments with motivated prequalified customers,\n→ Short sales cycle - most sales close in an hour or less,\n→ Financial Freedom - Uncapped Commission!,\n→ 10 Step Sales Training to become a Product knowledge expert,\n→ Benefits offered through the Independent Contractors Benefits Association,\n→ Company wide average close rate above 60% - 65%,\n,\nSell products that sells themselves with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, quality preset sales appointments.,\n,\nFor immediate consideration please contact Lauren with resume: Email: lbozik@leafhomesafetysolutions.com at C: 440-321-0441"
  },
  {
    "desc": ",\nOWNER OPERATORS – MAKE MORE MONEY $, MORE MILES === ,\nWe have great runs, high pay, fuel advances, quick pay, good miles. We have everything you need for true success.,\nALL YOU HAVE TO DO IS DRIVE.,\nWe are a professional trucking company which specializes in ensuring owner operators succeed and reach their full potential.,\n•\t48 States,\n•\tRegional runs,\n•\tCustomized runs,\n,\n•\tPOWER ONLY,\n•\tReefers,\n•\tDry Vans,\n•\tSpecialized Equipment,\n,\n,\n,"
  },
  {
    "desc": ",\nCDL Drivers ONLY respond please:,\nNeeded for Lowboy (smaller equipment hauling) and Single tandem dump truck,\nPay is based on experience $20-$25/Hr avg 50 hours/wk,\nHome every night/ all local runs DFW area,\nMUST pass a DOT drug screen and have valid physical card,\n,\nIf Interested, Please contact Codey Ray 817-412-0540 or email Codey@  Ray.codey@yahoo.com,\n,\n,"
  },
  {
    "desc": ",\n- Assist existing client's insurance service needs/requests,\n- Potential for commissions and bonuses on new policies and fees,\n- Normal business hours,\n- Retirement match, benefits, PTO, great base pay"
  },
  {
    "desc": ",\n,\n,"
  },
  {
    "desc": ",\nHard Rock Directional Drilling has immediate openings for experienced CDL Class A Truck Drivers to drive and work in the Oil & Gas Construction Industry.   Pipeline experience, Crew experience and ROW experience are all a plus.   ,\n,\nTRAVEL REQUIRED     *****     PAID PER DIEM,\n,\nSIGNING BONUS ,\n,\nHard Rock Driver Benefits:,\n• Medical, Dental, Vision, and Life paid 100% ,\n• 401(k),\n• Paid Weekly,\n• Paid vacation after 1st year,\n• Paid holidays,\n• Signing Bonus for Drivers,\n,\nDriver Requirements:,\n• Current and valid CDL Class A,\n• Tanker Endorsement Required    ,\n• Must be able to operate manual transmissions.  No automatics in fleet.  ,\n• Vacuum Truck experience a plus,\n• Current Medical Card,\n• Must pass DOT Drug Screening,\n• Work safely at all times,\n• PEC Safeland a plus,\n• H2S a plus,\n• TWIC a plus,\n,\nComplete Application online at www.hardrockhdd.com,"
  },
  {
    "desc": ",\n3k Sign on Bonus!,\n,\nWW Rowland was created by an owner operator in 1971 and our business is still being driven by the Owner Operator mentality. Our experienced team of transportation professionals work diligently on its Owner Operator's personal success through consistent competitive pay, safety compliance and transparent culture.,\n,\nWhat we offer:,\nDry Van and Intermodal Shipping Container Business!,\nFree Parking,\nZero equipment rental fees,\nNo touch freight,\nFuel discounts,\nConsistent work - Oklahoma, all over Texas, Arkansas, Louisiana and Tennessee,\n,\nRequirements:,\n2 years of verifiable Class A driving history,\nSafe driving history,\nPass background check,\n,\n,"
  },
  {
    "desc": ",\nHard Rock Directional Drilling has immediate openings for experienced CDL Class A Truck Drivers to drive and work in the Oil & Gas Construction Industry.   Pipeline experience, Crew experience and ROW experience are all a plus.   ,\n,\nTRAVEL REQUIRED     *****     PAID PER DIEM,\n,\nSIGNING BONUS ,\n,\nHard Rock Driver Benefits:,\n• Medical, Dental, Vision, and Life paid 100% ,\n• 401(k),\n• Paid Weekly,\n• Paid vacation after 1st year,\n• Paid holidays,\n• Signing Bonus for Drivers,\n,\nDriver Requirements:,\n• Current and valid CDL Class A,\n• Tanker Endorsement Required    ,\n• Must be able to operate manual transmissions.  No automatics in fleet.  ,\n• Vacuum Truck experience a plus,\n• Current Medical Card,\n• Must pass DOT Drug Screening,\n• Work safely at all times,\n• PEC Safeland a plus,\n• H2S a plus,\n• TWIC a plus,\n,\nComplete Application online at www.hardrockhdd.com,"
  },
  {
    "desc": ",\nNow Casting Virtual Couples Who’ve Yet to Meet in Person ,\n,\nEmmy Award Winning Bunim/Murray Productions (producers of MTV's The Real World) is now casting a New Relationship Experiment TV show. ,\n,\nAre you in love with someone you’ve never met in person? ,\n,\nFrom the pandemic to long distance to just plain nerves, whatever the reason, make your meeting the most memorable experience of your life! ,\n,\nIn this relationship experiment, you will meet the individual you are falling for in person for the first time ever. ,\n,\nAn adventure of a lifetime is just one click away! ,\n,\nTo Apply: ,  ,\n,\nOpen to all ages over 21. ,\n,\nPlease share with a friend who may be a fit! For questions, email us at castingnow@bunim-murray.com."
  },
  {
    "desc": ",\n,\n,\nLearn More: ,\n,\nTired of paying for dead leads and waiting for payment?\n,\nWith PunchList, you get high-quality repair and renovation jobs (not leads!) and we pay you directly.\n,\nHere's how it works and how to get started:\n,\n,\n,\nNo fees, no memberships -- just jobs.\n,\nStart free: ,"
  },
  {
    "desc": ",\n,\n,"
  },
  {
    "desc": ",\nWe are looking for construction personnel that want to get started working at our Arlington construction site ASAP!! NO EXPERIENCE REQUIRED, but it is a plus! If you have a strong work ethic and want consistent work (possible overtime), please reply to the ad with your name and contact information.,\n,\nWe have locations all over the Dallas/Fort Worth Metroplex area and other locations if this area do not suite you, just inquire with us through email. Details are below, Please reply to the ad with your NAME, and CONTACT INFORMATION and we will contact you immediately.,\n,\nJob duties include:,\n-Helping the superintendent with their daily duties,\n-Jobsite cleanup (sweeping),\n-Moving Materials,\n-Shoveling,\n- Etc.,\n,\n*Shifts are typically 7:00am-3:30 pm Mon-Fri*,\n*No Experience Necessary*,\n,\nPay = $12-13hr (1.5x Overtime),\n,\nRequirements:,\n- Proof of eligibility to work in the United States,\n- Must have jeans, boots,\n- Reliable Transportation,\n,\nPlease reply to the ad with you name and contact information.,\n,\nThank you!,\nEEO M/F/V/D,"
  },
  {
    "desc": ",\n, , , , , , ,"
  },
  {
    "desc": ",\nLawrence Merchandising Services (LMS) is becoming CROSSMARK Retail Solutions. We are seeking a detailed-oriented Retail Merchandiser to execute a variety of merchandise and product services at your favorite local retail stores. LMS is a well-known, reputable organization servicing the US and Canada for over 50 years.,\n,\nWe are hiring in multiple locations such as Addison, Irving, Fort Worth, Arlington, Frisco and Midland! Apply today!,\n,\nAs a Part Time Retail and Jewelry and Sunglasses Merchandiser, enjoy the freedom to make your own schedule while learning about our major retail partners, products, and services. We offer variety of assignments such as merchandising services, new product roll outs, seasonal support, product resets, building displays, signage, inventory replenishment and more!,\n,\n,\nBenefits:,\n,\nFind your balance with flexible days and hours.,\nGrowth potential, field, corporate, and leadership opportunities.,\nStart immediately, paid online training process to get you up to speed quickly.,\nHealth, vision, dental, short-term disability, life insurance, and 401(k) for those who qualify.,\nWeekly pay with the option of direct deposit. ,\nEmployee referral bonus program.,\nWork for a well-known, reputable company that’s been in business for over 50 years.,\nRequirements:,\n,\nAvailable to work up to 20 hours per week. Hours subject to increase with seasonal demands.,\nAccess to a smart device with an iOS or Android operating system.,\nEmail address and regular access to a phone with voicemail capability.,\nMust have reliable transportation.,\nShare LMS opportunities with your friends and family! referrals@lmsvc.com,\n,\nAs of today, LMS is continuing to provide merchandising services to our clients through the pandemic. We play a vital role in keeping essential products and customer favorites readily available. LMS complies with local and federal regulations and takes precautionary measures to keep our employees and retail partners safe and healthy."
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nBOOTH RENTAL AVAILABLE IN BEAUTIFUL UPSCALE PLANO SALON,\n,\nTWO WEEKS FREE!!,\n,\nPart-time and Full-time chairs available!,\n,\nJust a few of our MANY amenities Avenue Salon Beauty offers to our independent hair stylists to maximize your profits:,\n,\n- Great professional atmosphere.,\n- Daily fresh towels, smocks and capes.,\n- Daily refreshments for clients,\n- 24/7 Security system,\n- 24/7 salon access,\n- Complimentary Wi-Fi,\n- Sales commission on products,\n- Dedicated house keeping provided to salon DAILY,\n,\nWhat this means for you:,\n,\n- Short and long term rental options available,\n- Locally owned and operated,\n- Woman owned & Operated!!,\n- You set your own hours and service prices,\n- BE YOUR OWN BOSS!,\n,\n,\nCome visit us at Avenue Salon Beauty,\n4720 TX-121, Suite 120,\nPlano, TX 75024,\n,\nHours of operation:,\nMonday - Friday 9am - 7pm,\nSunday - 10am - 5pm,"
  },
  {
    "desc": ",\n**IMMEDIATELY HIRING** **DIRECT HIRE**,\n,\nPactiv Evergreen in Corsicana is looking for Packers, Operators and Maintenance Associates ready to join their team ASAP!!,\n,\nPackers:,\n• $1,000 Sign-On Bonus for Packers!!,\n• Day and Night shifts available,\n• Paying up to $17.31,\n,\nOperators:,\n• $1,500 Sign-On Bonus for Operators!!,\n• Pay starting at $17.85 and up,\n• Day and Night shifts available,\n,\nMaintenance:,\n• $1,500 Sign-On Bonus for Maintenance!!,\n• Pay range - $19.94-$29.94,\n• Rotating Shifts-2 weeks on days (7-7) then 2 weeks on nights (7-7),\n,\nApply now at the link below or text PTVE to 97211 to get an application started!!,\n,"
  },
  {
    "desc": ",\nKnowledge, Skills and Abilities Requirements,\nOverview,\nThis position typically completes duties involved in the completion of commercial and residential sprinkler repairs. We are searching for a talented and dedicated Landscaper to join our team. You will perform irrigation systems repairs. Make necessary repairs and adjustments to maintain all systems in proper working condition. Reports to and receives assignments, instructions, and direction from the Foreman or Supervisor.  Reads and/or interprets instructions and procedures. Moves materials and equipment to work locations and sets up work site. Front Fill, Back Fill, places grass back, Prepares construction sites, pours and spreads concrete, sets forms, and/or finishes surfaces. Completes records, maintains tools and equipment, and performs various clean-up and housekeeping activities. Observes and follows all safety rules and procedures, including wearing required personal safety equipment. Performs other duties and activities as directed.,\n,\nThe ideal candidate will be excellent problem-solving and organizational skills.,\n,\nCompensation,\nCommensurate with experience and ability. ,\n,\nRequired Knowledge, Skills and Abilities:,\n•\tValid Drivers License,\n•\tFamiliarity with applicable safe work practices including OSHA standards for concrete construction and site preparation.,\n•\tResponsible for the installation, maintenance and repair of complex irrigation systems.,\n•\tResponsible for efficiently the installation of time clocks that operate irrigation systems.,\n•\tResponsible for efficiently the making necessary repairs and adjustments to maintain all systems in proper working condition.,\n•\tEfficiently compiles and submit reports and records on conditions of all systems.,\n•\tResponsible for efficiently keeps and reports inventory of parts, supplies and equipment of irrigation systems.,\n•\tTest sprinkler system performs trouble shooting exercise. ,\n•\tPerforms related work as required and as directed.,\n•\tNotifies residents,\n•\tSkilled in the use of tools and equipment required for site preparation including shovels, picks, rakes, plate compactors and skid loaders.,\n•\tEfficiently and accurately place sprinklers.,\n•\tEfficiently places, test sprinklers and backfills,\n•\tAble to work in varying work shifts of 8-12 hours in extremely hot or cold temperatures.,\n•\tAble to lift objects of 50-75 pounds and perform assigned tasks, lifting, climbing, balancing, stooping, bending, crouching, kneeling, reaching and navigate safely on uneven ground and work in a variety of field conditions.,\n,\n•\tAble to use and apply common sense and understanding to carry out instructions furnished either orally, written or in diagrammatic form. Also, able to deal with normal problems that occur on project sites involving the variables involved in a concrete forming, pouring and finishing operation.,\n•\tHigh attention to detail with excellent organizational skills.,\n•\tPerforms any of the following duties or as directed by supervisor.,\n•\tAssists concrete finishers,\n•\tWorking as member of racially diverse crew in all types of weather conditions and in all types of environmental conditions such as dirt, mud, concrete.,\n•\tPreparing the worksite area for concrete footings, and assembling concrete forms at construction site locations.,\n•\tBending, Forming, Tying, and Installing rebar as illustrated in plan or as directed by supervisor.,\n•\tAligns and braces portions of project assembly, using bubble leveler, board, nails, and hammer. Measures distance between columns, using tape measurer or laser sighting.,\n•\tRemoves obstructions in grooves with hammer and chisel. Patches holes, cracks, and joints in assembled sections using mortar and trowel or necessary tools.,\n•\tFill forms or panels with wet concrete and vibrate, screed, trowel, or prepare surface, to ensure proper concrete settling and surfacing as necessary or as described in plan.,\n•\tTop off, screed, or float the top of wall with necessary tools as required.,\n•\tAssist in the overall cleanliness and organization of the shop area, jobsite & equipment, including tools, trucks & trailers.,\n•\tAdhere to all company policies and procedures.,\n•\tPerform miscellaneous duties as assigned,\n,\nPreferred Knowledge, Skills and Abilities:,\n,\n•\tConsiderable knowledge in the field of irrigation, installation, maintenance and repairs.,\n•\tKnowledge of the occupational hazards of the trade and of the proper use of safety practices.,\n•\tAbility to diagnose problems with electrical meters and pumps; necessary repairs and adjustments to maintain all systems in proper working conditions.,\n•\tAbility to install time clocks that operate irrigation systems.,\n•\tAbility to maintain records and submit reports on conditions of all irrigation systems.,\n•\tAbility to work a flexible schedule, including weekends, holidays and evenings, as required,\n•\tAbility to interpret irrigation plans.,\n•\tAbility to inventory parts, supplies and equipment of irrigation systems.,\n•\tAbility to install valve program for irrigation systems.,\n•\tAbility to operate various pieces of maintenance equipment.,\n•\tAbility to understand and carry out instructions and to complete work assignments correctly.,\n•\tAbility to perform heavy manual labor for extended periods, often under hot and humid conditions.,\n•\tAbility to establish and maintain effective working relationships with supervisors and other employees.,\nMandatory Requirements: ,\n•\tHigh school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.,\n•\tLanguage skills to communicate clearly and effectively-Bilingual (English/Spanish) is a plus.,\n•\tMaintenance abilities a plus.,\n•\tKnowledge of gas and diesel machinery.,\n,\n•\tMust be able to pass drug test if requested.,\n•\tValid State issued Driver's License.,\n•\tSelf-starter-motivator-hard worker-team attitude.,\n•\tGood attendance and on time is a must.,\n•\tRequired to perform task that include heavy lifting of 50 to 75 pounds, climbing, balancing, stooping, kneeling, crouching, crawling and reaching.,\n•\tMust be able to meet all safety requirements and applicable safety policies.,"
  },
  {
    "desc": ",\nQuality Sand and Gravel in Hendrix OK is hiring experienced Company and Owner Operator end dump CDL drivers.  Top pay, $2500 sign on bonus, daily attendance bonus pay, medical insurance available for Company Drivers.  Owner Operators 100% freight rate.  Free truck parking for Owner Operators.  Yards located in Hendrix OK, Howe TX, and Nevada TX.,"
  },
  {
    "desc": ",\nHello All,,\n,\nWe are looking for an experienced mechanic to join our team at Best Auto Center. We are a full service mechanic and body shop with 5 lifts, and 7 bays. We are a family owned and operated shop that services our 3 dealership (Luxury Auto Inc) cars so there is always work. Looking for full time, honest, hard working, and professional work. We have been in business for over 35 years, and have a family type culture at our shop. Must have own tools, experience, good attitude, and be reliable. Please call at 817-496-6300 or email and ask for Ray or Omar to set up an interview. We look forward to hearing from you!"
  },
  {
    "desc": ",\nLandscape Foreman (Mckinney),\ncompensation: $16- $20 plus overtime employment type: full-time,\nCommercial Landscape company in need of Landscape Foreman. You must have a good Texas Driver's license and be comfortable pulling a trailer. You must also be able to run your crew members and have experience doing this. Bi lingual a plus. If you meet the above qualifications and want a job with a growing company you can call the office at 817-372-6717 or email in your resume ,\nPay is negotiable depending on experience $16- $20 plus overtime at time and one half. We offer paid holidays, paid vacation, insurance, and retirement plan.,\nWe are also hiring experienced laborers with or without a driver's license! $15-$18 ,\n,\nPaisaje Capataz (Mckinney),\nPagamos $16- $20 por hora pagamos tiempo extra.,\nEmpresa Comercial primer en la necesidad de paisaje Foreman. debe tener una buena licencia de conducir de Texas y estar cómodo tirando de un remolque.,\nTambién debe ser capaz de instruir a los miembros de su grupo y tienen experiencia haciendo esto. Bilingüe es una ventaja. Si cumple con los requisitos anteriores y desea un trabajo con una empresa en crecimiento puede llamar a la oficina al 817-372-6717 o por correo electrónico en su hoja de vida a,\nEl sueldo es negociable en función de la experiencia de $ 16- $ 20 más horas extras a tiempo y medio. Ofrecemos vacaciones pagadas, vacaciones pagadas, seguros y planes de jubilación.,\nTambién estamos contratando trabajadores experimentados con o sin una licencia de conducir ! $15-$19,\n,\nIrrigators,\nexperienced irrigators wanted in Mckinney,\nNeed experienced landscape sprinkler installers and service techs. Must know Tucor  2 wire system. Texas Irrigation license preferred but not required. Pay is $18 - $22 per hour depending on experience. ,\nWe offer overtime pay, paid holidays, paid vacation, insurance and 401K plan with employer matching. Guaranteed work all year. ,\nCall 817-372-6717 to apply or send resume to Monty,\n,\nInstaladores de irrigacion ,\nNecesitamos instaladores de irrigacion con experiencia aquí in Mckinney. Debe conocer el sistema de 2 hilos Tucor,\nlicencia de Texas Irrigación prefiere pero no se requiere, pagamos $16- $22 por hora dependiendo de experiencia.,\nOfrecemos el pago de horas extras, las vacaciones pagadas, vacaciones pagadas, seguro y 401K plan con coincidencia de patrón. Garantizado el trabajo durante todo el año.,\nLlame 817-372-6717 para aplicar o enviar hoja de vida a Monty,"
  },
  {
    "desc": ",\nCall 817-484-5999 to schedule an interview with our REGIONAL MANAGER THIS WEEK and START ASAP!!!,\n,\nWe Represent the Largest and most Reputable Energy Supplier in the US. ,\n,\n$$$ Our compensation plan is paid weekly, average $1,000-$3,000 per week not including weekly and monthly bonuses $$$ ,\n,\n*No experience required ,\n*Compensation: Paid Weekly + Bonus Package,\n*Bi-lingual agents a plus but not required ,\n*Employment type: Full-Time,\n*Students Welcome to Apply,\n,\nCall 817-484-5999 and book your interview today!,"
  },
  {
    "desc": ",\n* Tenemos varias posiciones para conductores con licencia tipo Clase A, con alta paga y todos los beneficios.,\n,\n* Llamar a Jesus al (281) 751-3359 si esta interesado,\n,\n* También puede usar esta liga para mandar su información y le regreso la llamada ,\n,\n* Este trabajo es 100% descarga táctil del conductor. Cajas no muy pesadas de tiendas dolar.,\n,\n* $1,650 - $2,000 Promedio semanal.,\n,\n* $6,000 de Bono por contratación.,\n,\n* En casa una vez a la semana para reinicio de 34 horas.,\n,\n* Operara en TX, OK, AR, KS, CO, WY, LA,\n,\n* Cada conductor puede hacer un promedio de 1500 millas por semana y esperar tirar al menos 3 cargas por semana. Cada carga es de varias paradas y puede tener hasta 6 paradas por remolque. ,\n,\n* Todos los beneficios. Seguro de Salud, Vista, Dental, y 401K.,\n,\n* Tractores Automáticos y nuevos.,\n,\n* Trabajo permanente, nuestra carga nunca se detiene.,\n,\n* Deposito directo semanal.,\n,\n* Llamar a Jesus al (281) 751-3359 si esta interesado,\n,\n* También puede usar esta liga para mandar su información y le regreso la llamada ,"
  },
  {
    "desc": ",\nWe are looking for construction personnel that want to get started working at our Garland construction site ASAP!! NO EXPERIENCE REQUIRED, but it is a plus! If you have a strong work ethic and want consistent work (possible overtime), please reply to the ad with your name and contact information.,\n,\nJob duties include:,\n-Helping the superintendent with their daily duties,\n-Jobsite cleanup (sweeping),\n-Moving Materials,\n-Shoveling,\n- Etc.,\n,\n*Shifts are typically 8:00am-4:30 pm Mon-Fri*,\n*No Experience Necessary*,\n,\nPay = $11.50-$12.50hr (1.5x Overtime),\n,\nRequirements:,\n- Proof of eligibility to work in the United States,\n- Must have jeans, boots,\n- Reliable Transportation,\n,\nPlease reply to the ad with you NAME and CONTACT INFORMATION.,\n,\nThank you!,\n,\nJob Type: Full-time,\n,\nPay: $11.00 - $12.00 per hour,"
  },
  {
    "desc": ",\nC.C. Zamora Construction is looking for a Concrete, Asphalt Dirt Work Estimator for a family own growing company. Must be highly motivated with a strong work ethic who projects and controls construction costs by collecting and studying information, controlling construction costs. They would also be responsible for completing detailed and itemized material quantity estimates from owner or contractor furnished plan sets.,\n,\n,\n,\nMajor Tasks, Responsibilities and Key Accountabilities:,\n•\tCompletes detailed and itemized material quantity estimates from owner or contractor furnished plan sets. ,\n•\tDetermines accurate quantities related materials as measured from provided plan sets. ,\n•\tIdentifies materials required for the construction of facilities. ,\n•\tResearches plans and specifications to determine any special material requirements. ,\n•\tProcures picks-up and returns plan sets as required. ,\n•\tCommunicates with contractor or owner to clarify any unusual or special material issues. ,\n•\tDetermines if supplied materials meet local/state/federal specifications. ,\n•\tPerforms other duties as assigned,\n,\nNature and Scope:,\n•\tWorks in compliance with established procedures and/or protocols.  Identifies and resolves readily identifiable, clearly defined problems. Demonstrates skill in data analysis, techniques by resolving missing/incomplete information, and inconsistencies/anomalies in routine research/data. ,\n•\tNature of work requires general supervision; exercises judgment.  Work typically involves regular process checks or review of output by a supervisor. ,\n,\nWork Environment:,\n•\tAlthough estimators generally work in offices, this job would require you to visit the proposed job sites, may be asked to pick up material if needed and most importantly follow up with the customer frequently on the progress of the particular job. ,\n•\tTherefore this job does require some travel.,\n•\tOn occasions there may be a need to move or lift equipment or materials up to 50 pounds. ,\n•\tThere may be regular exposure to mild physical discomfort from factors such as dust, fumes or odors, temperature extremes, loud noise, strong drafts, or bright lights. ,\n,\nQualifications:,\nEducation and Experience,\n•\tTypically requires BS/BA in related discipline.  Generally, 0-2 years of experience in related field OR MS/MA and generally 0-1 year of experience in related field. ,\n•\tNeeds to have experience in Concrete & Asphalt estimating. ,\n,\nPreferred Qualifications,\n•\tExperience in bid preparation, sales or related industry experience. ,\n•\tExcellent written and verbal communication skills.,\n•\tMust know Microsoft Office products including Word and Excel.,\n•\tMust be self-motivated & punctual.,\n•\tMust be able to manage multiple tasks and have excellent follow up skills both internally and externally.,\n•\tMust be professional and polished in appearance and speech.,\n•\tZ C requires that you have knowledge of asphalt estimating, Z C is construction will bid mostly City projects, CIP, WSM. On the asphalt Z C will be Commercial & residential. On the concrete Z C will be some small residential jobs. Z C will bid concrete & asphalt jobs to able to give to small contractors. ,\n,\n,\n,"
  },
  {
    "desc": ",\nNeeding an attention to detail and self motivated landscaper. Must be able to handle 7-11 yards and/or special projects daily. Must have a valid driver's license. Looking for someone to start immediately. Will discuss pay upon employment.,"
  },
  {
    "desc": ",\n-Dallas-based company, 42 years in business-,\n-Permanent, full-time position with immediate hire-,\n,\nWe are seeking an organized, detail-oriented person to handle our shop office.  The duties will include but not be limited to:,\n,\n*Must be fluent in English and Spanish (Bilingual)*,\nTrack equipment maintenance,\nSearch for and order parts,\nManage all parts deliveries,\nManage all service and PM appointments,\nTrack shop employee times on each assignment,\nClose repair orders and work orders in computer,\nManage all receipts and invoices received from suppliers related to shop,\nEvaluate vendor performance and facilitate required repairs,\nReview and perform physical count of all inventory reports and prepare requisitions for all equipment parts,\nMaintain neat and clean parts room at all times and recommend ways to improve efficiency and reduce downtime,\n,\nM-F 7-4p,\nStarting pay is $21/hr, 40-hours a week,\nraises within first year based on performance,\n,\nPlease send resume or apply in-person:,\n1200 N Walton Walker Blvd,\nDallas, X  75211,\n,"
  },
  {
    "desc": ",\n-Dallas-based company, 42 years in business-,\n-Permanent, full-time position with immediate hire-,\n,\nWe are seeking an organized, detail-oriented person to handle our shop office.  The duties will include but not be limited to:,\n,\n*Must be fluent in English and Spanish (Bilingual)*,\nTrack equipment maintenance,\nSearch for and order parts,\nManage all parts deliveries,\nManage all service and PM appointments,\nTrack shop employee times on each assignment,\nClose repair orders and work orders in computer,\nManage all receipts and invoices received from suppliers related to shop,\nEvaluate vendor performance and facilitate required repairs,\nReview and perform physical count of all inventory reports and prepare requisitions for all equipment parts,\nMaintain neat and clean parts room at all times and recommend ways to improve efficiency and reduce downtime,\n,\nM-F 7-4p,\nStarting pay is $21/hr, 40-hours a week,\nraises within first year based on performance,\n,\nPlease send resume or apply in-person:,\n1200 N Walton Walker Blvd,\nDallas, X  75211,\n,"
  },
  {
    "desc": ",\n-Dallas-based company, 42 years in business-,\n-Permanent, full-time position with immediate hire-,\n,\nWe are seeking an organized, detail-oriented person to handle our shop office.  The duties will include but not be limited to:,\n,\n*Must be fluent in English and Spanish (Bilingual)*,\nTrack equipment maintenance,\nSearch for and order parts,\nManage all parts deliveries,\nManage all service and PM appointments,\nTrack shop employee times on each assignment,\nClose repair orders and work orders in computer,\nManage all receipts and invoices received from suppliers related to shop,\nEvaluate vendor performance and facilitate required repairs,\nReview and perform physical count of all inventory reports and prepare requisitions for all equipment parts,\nMaintain neat and clean parts room at all times and recommend ways to improve efficiency and reduce downtime,\n,\nM-F 7-4p,\nStarting pay is $21/hr, 40-hours a week,\nraises within first year based on performance,\n,\nPlease send resume or apply in-person:,\n1200 N Walton Walker Blvd,\nDallas, X  75211,\n,"
  },
  {
    "desc": ",\n-Dallas-based company, 42 years in business-,\n-Permanent, full-time position with immediate hire-,\n,\nWe are seeking an organized, detail-oriented person to handle our shop office.  The duties will include but not be limited to:,\n,\n*Must be fluent in English and Spanish (Bilingual)*,\nTrack equipment maintenance,\nSearch for and order parts,\nManage all parts deliveries,\nManage all service and PM appointments,\nTrack shop employee times on each assignment,\nClose repair orders and work orders in computer,\nManage all receipts and invoices received from suppliers related to shop,\nEvaluate vendor performance and facilitate required repairs,\nReview and perform physical count of all inventory reports and prepare requisitions for all equipment parts,\nMaintain neat and clean parts room at all times and recommend ways to improve efficiency and reduce downtime,\n,\nM-F 7-4p,\nStarting pay is $21/hr, 40-hours a week,\nraises within first year based on performance,\n,\nPlease send resume or apply in-person:,\n1200 N Walton Walker Blvd,\nDallas, X  75211,\n,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nWE OFFER:,\nPay above the average!!,\nSolo Drivers up to $0.80 per mile,\n1099 ,\n100% No touch freight,\nAll miles paid (zip code to zip code),\n$6000 sign-on bonus, $1500 referral bonus, and safety bonuses.,\nDetention, layover ,\nDirect deposits every Monday,\n ,\nEQUIPMENT:,\nTractors: ,\nNewest 2022-2023 Freightliner Cascadia EVOLUTION with LED Headlights, Power Inverter, Fridge, APU Units, Adaptive Cruise Control,\nVolvo VNL 760 2022-2023 with Power Inverter, Fridge, APU Units, I-SHIFT automatic transmission.,\n ,\nREQUIREMENTS:,\nApplicants must have at least 23 years of age,\nMinimum 2 years of OTR verifiable experience,\nClean MVR & PSP records over a period of 3 years,\nClean criminal background,\nNo DUI in a period of 5 years,\n,\nFor more information text or call:,\n,\nMitch Jones (773) 302-1687,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n, ,"
  },
  {
    "desc": ",\nWe are searching for a dedicated and hardworking individual to work as an apprentice for a local HVAC firm. This position will be full-time and will provide an excellent learning opportunity. It is a fantastic opportunity for a student. This is a salary Non-exempt position; you will be paid 40 hours per week even if you only worked 1 hour per week. You will also be able to choose your own time. Please send me your resume if you interested. ,\n,\nMust be able to diagnose and make repairs to HVAC equipment,\nYou must have reliable transportation.,\nPrincipals only. Recruiters, please don't contact this job poster.,\ndo NOT contact us with unsolicited services or offers,"
  },
  {
    "desc": ",\nImmediate hire for a Logistic Coordinator for a trucking company.,\nThis is a direct hire position. Full time. Long term employment!,\nResponsibilities include:,\n,\nRouting, planning and dispatching all drivers.,\nEnsuring that drivers are following DOT rules and guidelines.,\nMaking sure DOT logs are kept as per requirements.,\nUpdate and maintain company software.,\nMaintaining good relationships with clients, brokers and shippers.,\nCommunicating, and updating shippers, receivers as needed.,\nInspections are completed as per company requirements.,\nMust be able to walk around truck yard and physically check equipment.,\nMaking sure all equipment is up to date and serviced as per schedule.,\nMust be able to update team on weekends.,\n,\nRequirements:,\n,\nEmail, scanning, downloading and uploading.- Computer skills.,\nCommunication skills, how to effectively communicate via email, text etc.,\nStable resume with a strong work history in dispatcher/logistics field.,\nReliable car to and from Grapevine, Texas.,\nValid Drivers license is required. Must be legally allowed to work in US.,\nMust be able to work from home, and update team on weekends.,\n,\nCompensation:,\n$40K-$50K per year! Medical Benefits! Paid Vacation, PTO time.,\nPlease submit a resume for consideration.,\n,\nJob Type: Full-time in office 8am-5pm."
  },
  {
    "desc": ",\nImmediate hire for a Logistic Coordinator for a trucking company.,\nThis is a direct hire position. Full time. Long term employment!,\nResponsibilities include:,\n,\nRouting, planning and dispatching all drivers.,\nEnsuring that drivers are following DOT rules and guidelines.,\nMaking sure DOT logs are kept as per requirements.,\nUpdate and maintain company software.,\nMaintaining good relationships with clients, brokers and shippers.,\nCommunicating, and updating shippers, receivers as needed.,\nInspections are completed as per company requirements.,\nMust be able to walk around truck yard and physically check equipment.,\nMaking sure all equipment is up to date and serviced as per schedule.,\nMust be able to update team on weekends.,\n,\nRequirements:,\n,\nEmail, scanning, downloading and uploading.- Computer skills.,\nCommunication skills, how to effectively communicate via email, text etc.,\nStable resume with a strong work history in dispatcher/logistics field.,\nReliable car to and from Grapevine, Texas.,\nValid Drivers license is required. Must be legally allowed to work in US.,\nMust be able to work from home, and update team on weekends.,\n,\nCompensation:,\n$40K-$50K per year! Medical Benefits! Paid Vacation, PTO time.,\nPlease submit a resume for consideration.,\n,\nJob Type: Full-time in office 8am-5pm."
  },
  {
    "desc": ",\nIf you like getting paid weekly, not having to wait for loads, and no touch freight come join our team!,\n,\n-DEDICATED FREIGHT TO SOUTH EAST!!! DRUG TEST TODAY START TOMORROW!,\n,\n,\n,\nTruck Driver Qualifications,\n,\n• Experienced truck drivers,\n• Minimum 6 months CDL Class \"A\" holders,\n• Acceptable driving record,\n• Knowledge of DOT rules and regulations,\n,\nEquipment ,\n• New well maintained equipment ,\n,\n,\nFull-time CDL truck drivers are eligible for:,\n• $0.57 - $0.70 loaded and empty mile (Based on experience and driving record),\n• Weekly direct deposit payments,\n• 99% No Touch Freight,\n• 24 hours dispatch,\n• Safety bonuses for good inspections,\n• On time delivery bonus,\n• Drop &Hook available for dedicated teams ,\n,\nRoutes,\n• SOUTH EAST (TEAM),\n,\nStart on the road as soon as possible to enjoy more miles and bigger money.,\nFor more information, please call us 559-826-8320. ,\n,\nFollow us on Instagram @OffTopLogistics,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\n, OTR Class A Drivers,\n,\n-earn up to 85k + a year,\n-CPM,\n-Direct Deposit,\n-W-2,\n-home consistancy,\n-guaranteed detention pay,\n-pet friendly,\n-all trucks APU equipped,\n-address to address pay no shorting on miles ,\n-Empty and Loaded miles Paid,\n-layover pay $150 per day,\n-no touch freight,\n-freight consistency all year round,\n-Occupational insurance,\n-Flexible schedule,\n-Holidays Off,\n-$1500 driver referral bonus ,\n-All trucks Inverter equipped,\n-3000-3400weekly miles,\n-Safety bonus,\n-Christmas bonus,\n-Perfromance Bonuses,\n,\nQualifications,\n-valid class A CDL,\n-clean MVR,\n-MINIMUM 2 yrs experience,\n-Clear house complete,\n,\n,\n ,M&H Trucking LLC,"
  },
  {
    "desc": ",\nOWNER OPERATORS ARE AVERGING $400K-$500K A YEAR IN REVENUE PER TRUCK!!!,\n,\n$2,000 SIGN ON BONUS PER TRUCK!!!!!,\n,\nHAVE THE HIGHEST RATE ACCOUNTS IN WEST TEXAS. PAYING AS MUCH AS $85 A HOUR TO OWNER OPERATOR! EACH TRUCK AVERAGING 80-90 HOURS EACH WEEK. ALL LOCAL JOBS WITHIN 50 MILE RADIUS, HOME DAILY, LITTLE DRIVE TIME, LOTS OF STANDBY TIME. CALL ASAP!,\n,\nPAY/BENEFITS:,\n24/7 WORK AVAILABILITY,\nPLENTY OF HOURS,\nNO INSURANCE DEPOSITS,\nPAID WEEKLY SETTLEMENT CHECKS,\nNO HIDDEN DEDUCTIONS,\n,\nTRUCK/TRAILER REQUIREMENTS:,\nMUST BE REGISTERED,\nMUST BE INSPECTED,\nMUST HAVE 2290,\nSOLID COLORS/DECENT LOOKING,\nPASS LEVEL 1 DOT INSPECTION,\n,\nDRIVER REQUIREMENTS:,\nSPEAK FLUENT ENGLISH!,\nMUST HAVE CDL HISTORY FOR 2 YEARS,\nMUST HAVE TANKER ENDORSEMENT,\nMUST HAVE 6+ MONTHS VACUUM EXPERIENCE,\nMUST HAVE SAFELAND & H2S CERTIFICATION,\nCANNOT HAVE MORE THAN 3 TICKETS IN PAST 3 YEARS,\nCAN PASS A DRUG TEST AND ROAD TEST,\n,\nTO LEASE ON CALL,\nSTEPHEN-432-349-8841"
  },
  {
    "desc": ",\nOWNER OPERATORS ARE AVERGING $400K-$500K A YEAR IN REVENUE PER TRUCK!!!,\n,\n$2,000 SIGN ON BONUS PER TRUCK!!!!!,\n,\nHAVE THE HIGHEST RATE ACCOUNTS IN WEST TEXAS. PAYING AS MUCH AS $85 A HOUR TO OWNER OPERATOR! EACH TRUCK AVERAGING 80-90 HOURS EACH WEEK. ALL LOCAL JOBS WITHIN 50 MILE RADIUS, HOME DAILY, LITTLE DRIVE TIME, LOTS OF STANDBY TIME. CALL ASAP!,\n,\nPAY/BENEFITS:,\n24/7 WORK AVAILABILITY,\nPLENTY OF HOURS,\nNO INSURANCE DEPOSITS,\nPAID WEEKLY SETTLEMENT CHECKS,\nNO HIDDEN DEDUCTIONS,\n,\nTRUCK/TRAILER REQUIREMENTS:,\nMUST BE REGISTERED,\nMUST BE INSPECTED,\nMUST HAVE 2290,\nSOLID COLORS/DECENT LOOKING,\nPASS LEVEL 1 DOT INSPECTION,\n,\nDRIVER REQUIREMENTS:,\nSPEAK FLUENT ENGLISH!,\nMUST HAVE CDL HISTORY FOR 2 YEARS,\nMUST HAVE TANKER ENDORSEMENT,\nMUST HAVE 6+ MONTHS VACUUM EXPERIENCE,\nMUST HAVE SAFELAND & H2S CERTIFICATION,\nCANNOT HAVE MORE THAN 3 TICKETS IN PAST 3 YEARS,\nCAN PASS A DRUG TEST AND ROAD TEST,\n,\nTO LEASE ON CALL,\nSTEPHEN-432-349-8841"
  },
  {
    "desc": ",\n•QUICK START-STRAIGHT FROM HOME!!!,\nSOLO GROSE $6000-$12000,\n,\n •JOB APP ONLINE,\n •ORIENTATION ONLINE,\n •PLATE PROGRAM,\n💻NO FORCED DISPATCH,\n•OVER THE ROAD LOADS,\n•EXPEDITE LOADS,\n•REGIONAL LOADS,\n,\n$0,20 PER GALLON FUEL DISCOUNT!!!,\n,\n✅BUY BRAND NEW TRAILER $0 DOWN,\n,\nSOLO-WEEKLEY GROSS $6,0000-$12,000,\n$2 up to $5 per mile loads,\n(in the current market),\nOver the road loads!,\nNO TOUCH FREIGHT!,\nDIRECT DEPOSIT WEEKLEY,\nRATE CONFIRMATION PER LOAD,\nALL MILES PAID,\n,\nTEAM DETAILS:,\n1.Over the road,\nWEEKLY GROSS $12000-$20000,\n(In the current market),\n,\n📞Michael 817-363-5795,\n,\n•ONE TRUCK ONE DISPATCHER,\n88% per gross per load,\nBest Safety Score !!!,\n24/7 dispatch office,\n24/7 track-trace office,\n24/7 E loog office,\nPlate-Registration program!,\nEFS code support 24/7,\nWe handle IFTA for you,\n✅Safety clean inspection Bonus!,\nFrom $100-$5000!!!,\nBe part of our family ,\n,\nOne truck one dispatcher only ,\n,\n******Call Michael 817-363-5795**********,"
  },
  {
    "desc": ",\nAustin Wood Works, Inc. has been in business since 1980. We are looking to fill a Cabinet Engineer/Designer Position Immediately.,\nWe specialize in Custom Finishes and High-End Cabinetry.,\n,\nMust have a high level of experience working in a high-end cabinet shop.,\nMust be able to produce full scale cabinet layout/templates for complicated high-end projects.,\nExperience working with CabinetWare or Cabinet Vision,\nMust be creative and highly motivated,\nAbility to clearly communicate engineering specifications of design details to project managers, production and installation crews.,\nMust be well organized, dependable, self-motivated and thorough with drawing details,\nWill conduct themselves in a professional manner while troubleshooting and problem-solving various challenges,\nMust work well with others: designers, builders, architects and team members,\n,\nPlus Qualifications:,\n,\nShop experience 3-5 years prefered,\nCNC Programming experience desirable,\nOther program experience a plus,\n,\nResponsibilities:,\n,\nOrganize and study all preliminary project meeting notes/information, proposal and architect/designer prints and elevations,\nProduce preliminary drawings and conduct meeting with designer and project manager,\nWeekly schedule updates based off of your successes and/or challenges,\nIdentify any conditions that may conflict with design, production or installation,\nRevise cabinet drawings based off of designer, builder/architect redlines,\nPrepare final drawings ready to be prepared for cut list and production,\n,\nOnly qualified candidates need to apply,\n,\nMatching 401K,\nPaid Holidays,\nHealth Insurance,\nLife Insurance,\nDisability Insurance,\nDirect Deposit,\nRelocation Assistance Available,"
  },
  {
    "desc": ",\n🔥POWER ONLY-DROP&HOOK🔥,\n      No touch refrigerated freight ,\n,\n🚚TRUCKS 2019-2022 ,\nFully equipped-Automatic and Manual  transmission ,\nVOLVO,FREIGHTLINER,KENWORTH,INTERNATIONAL,\n❗️Our program cover Maintenance🔧,\n,\n❗️ZERO DOWN -Direct deposit every Friday-CASH ADVANCE after first load❗️,\n💰Have referral BONUS ,\n💥FAST HIRING PROCESS ONLINE💥  ,\n,\n🔥LEASE to Rent 🔥 ,\n💰WE PAY YOU 85% from GROSS,\n💸Lease SOLO Drivers: $2.500-$4.500+  Take home money weekly ,\n💸Lease TEAM Drivers: $5.000-$9.000+ Take home money weekly fot team,\n, \n🔥COMPANY drivers 🔥,\nSolo/Team-FiXed Salary GUARANTEE ,\n ,\n🚨WE PROVIDE: Prepass(weight stations), Bestpass(tolls), Fuel Card(Flying J/Loves/Pilot), ELD (Tracksense), Tablet(s),\n,\n❗️24h Dispatch-24h Maintenance-All 48 States-Load Lines-OTR❗️,\n,\n🚀Requirement:,\n✔️ Minimum of 8 months OTR experience,\n✔️ DOT Medical Card,\n✔️ Clean MVR & PSP records in a period of 3 years,\nFor more information or apply, please call or text me: (630) 283-6788 Kristina,\n,\n,\n,\n,\n,"
  },
  {
    "desc": ",\n,\n,"
  },
  {
    "desc": ",\nWe hire company drivers 25%-30% from the gross no deductions,\nWe hire owner operators 88% from the gross income 7000-13000 per week,\nWe hire lease drivers 85% from the gross 7000-13000 per week,\nSELF DISPATCH AVAILABLE,\nOversized loads,\nDry van, Flat bed, Step deck, Conestoga,,\n,\nPlease call your HR Specialist Marko at 872-999-8262"
  },
  {
    "desc": ",\n,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n\n,\n,"
  },
  {
    "desc": ",\nDrive a commercial vehicle and trailer to various loading and unloading sites as dispatched. Adhere to all DOT regulations and Company policies and procedures.,\n,\nDuties:,\n,\nDrive a commercial vehicle to various locations,\nMake on time load/delivery appointments,\nBe available for dispatch,\nWork independently,\nCourteous to customers and their employees,\nShare the road with others in a professional and safe manner,\nRequirements:,\n,\nMust be able to speak, read, and understand the English language,\nHave a valid Class A Commercial Drivers License,\nCurrent DOT Physical Certification,\nGood MVR-no DUI’s, no more than 2 at fault DOT reportable accidents, no reckless/careless driving within the last 3 years, no more than 2 speeding violations in the last year,\nTwo years verifiable experience driving a commercial vehicle,\nFamiliar with Federal Motor Carrier Regulations for equipment/inspections, driver rules, hour regulations, and drug/alcohol requirements,\nRead a map, follow directions,\nFollow Company policies and procedures,\nDrive day/night in a variety of traffic and weather conditions,\nAbility to drop and hook trailers,\nKnowledge of reefer units,\nSafety check equipment,\nDo minor repairs if necessary,\nForklift Certification,\nDrive safely 11 hours a day on a flexible schedule,\nPhysical Demands:,\n,\nSitting for long periods of time,\nClimbing,\nPushing & pulling,\nWinding/unwinding motions,\nStoop, kneel, crouch, or crawl,\nAbility to lift up to 75 pounds"
  },
  {
    "desc": ",\nMust tools and prior experience,\nCompany Truck ,\nMonday- Friday 9-5pm,\n,\n,\nLumen Lighting and Electric is looking for an experienced Electrician to undertake a variety of tasks relating to setting up and maintaining electrical infrastructure. Your job will involve installing electrical wiring in buildings and poles, troubleshooting malfunctions and blackouts and repairing appliances. Due to the high amount of risk pertaining to this job, electricians must be first and foremost responsible individuals with great attention to safety precautions. The ideal candidate must be experienced in different kinds of electrical devices and systems. The goal will be to produce and maintain well functioning electrical connections to minimize the probability of accidents and maximize usability of electricity in all facilities.,"
  },
  {
    "desc": ",\nWe’re a Chicago based company that runs dry vans and reefers. Our dedicated team of dispatchers guarantees success by fully committing and devoting time and energy to your truck. Only 5 trucks per dispatcher. If you don’t own equipment we can help with our Lease Purchase program with no credit check. ,\n ,\n,\n,\n,\n,\n,\n,\n,"
  },
  {
    "desc": ",\nOperating since 1984 and still growing! We work hard to keep our drivers happy!!,\n,\n** 25% - 28% OF REVENUE **,\n**$2,000 SING ON BONUS**,\n* ELD AND PAPER LOG TRUCKS AVAILABLE*,\n* AUTOMATICS AND MANUALS AVAILABLE*,\n* NEW AND CLEAN EQUIPMENT*,\n* HEALTH, VISION, AND DENTAL BENEFITS! *,\n* PAID WEEKLY! CURRENT DRIVERS ARE BRINGING HOME $2500 TO $3500 A WEEK!! (on average this equates to 93 cents per mile)*,\n* HOME WEEKENDS! DRIVERS LEAVE SUNDAY AND RETURN ON FRIDAY*,\n* FUEL CARDS*,\n* IN-HOUSE MAINTENANCE CREW*,\n* TIRE INFLATION AND ROUTINE MAINTENANCE EVERY WEEKEND*,\n* TRUCKS CLEANED EVERY WEEKEND*,\n* PASSENGER PROGRAM AND PET POLICY*,\n,\n****MOST OF OUR DRIVERS MAKE OVER $100,000 A YEAR!****,\n,\nAs a family owned company, we care about keeping our drivers happy. That means great communication and understanding, weekly pay, and home every weekend. We have an in-house maintenance crew to provide both routine maintenance and immediate action on repairs if needed. Automatic ELD's available! APPLY HERE: ,\n,\nDriver Qualifications Include:,\n Valid Class A CDL REQUIRED ,\n• Minimum 23 years of age ,\n• Minimum two-year recent and verifiable flatbed (including tarping) experience ,\n• Clean driving and safety record ,\n• Maintain required productivity standards and exceptional customer service ,\n• Must adhere to all safety requirements and work procedures ,\n• Ability to perform physical requirements of the job ,\n• Ability to work in all weather conditions ,\n• Successfully pass a road test, DOT physical, drug screen, and background check ,\n• Previous oversize hauling is preferred ,\n• No hours-of-service violations preferred ,\n,\nHiring Requirements:,\nNo more than 3 tickets in the last 3 years,\nNo DWI/DUI convictions in the past 5 years,\nMust have experience operating ELD device,\nClass A Commercial Driver's License,\nAbility to follow instructions and complete regular training,\n,\nYou can check us out at www.cowtownexpress.com. Family owned and operated since 1984.,\nCome and join our family!,\n,\nCall 817-590-8686 / 682-348-5820 during normal business hours or text Lawrence at 214-609-8562,\n,\nAPPLY HERE!,\n,\n,\nLooking for drivers ASAP so call for an interview today! We will get you driving same week!,"
  },
  {
    "desc": ",\nWe need OTR Dry Van and Flatbed drivers ASAP,\n,\n,\nWe offer an expedited onboarding process for Over The Road Go Getters who stay on the road for an extended amount of time and make their financial goals happen by doing so.,\n,\n,\nWe welcome safe, professional, dependable, proactive and goal oriented drivers with strong work ethic.,\n,\n,\nWe will reimburse you for your airplane ticket once you show up to pick up the truck.,\n,\n,\nIf this is you, read on.,\n,\n,\n,\nYou:,\n,\n,\nAre passionate about Over The Road Trucking - for you OTR is a lifestyle, a calling, not a job,\n,\n,\nYou choose to stay 4 plus weeks on the road, because that’s how you roll, that’s how you make your financial goals happen,\n,\n,\nYou know the roads and you go where the load takes you, because you know that being picky could mean limited amount of miles for you,\n,\n,\nHave a good command of English language and Communicate effectively (Written and Spoken),\n,\n,\nHave a positive attitude,\n,\n,\nHave and know how to use smartphone to send BOLs/PODs and install tracking apps,\n,\n,\nAble to pickup and deliver loads on time in a safely manner,\n,\n,\nPerform proper Pre Trip Inspections,\n,\n,\n,\nWe offer:,\n,\n,\n53’ Dry Van and 53’ Flatbed,\n,\n,\n,\nMaximum amount of miles optimized for your driving style and earning expectations,\n,\n60 - 80 cents per mile depending on experience (all miles paid, empty and loaded),\n,\n,\n,\nNewer, Clean Well Maintained Equipment,\n,\nTruck Speed Limit To Your Liking,\n,\nInverter And Fridge In Every Truck,\n,\n24/7 Friendly Dispatch with extensive OTR experience,\n,\n24/7 ELD Support,\n,\n24/7 Repair Support,\n,\n,\n,\nLease purchase program and access to our direct customer freight after one year as a company driver.,\n,\nOwner Operators with their own equipment welcome.,\n,\n,\nWeekly Pay,\n,\nCash advance,\n,\nDirect Deposit,\n,\nFuel Card (Nationwide Fuel Network),\n,\nReferral Bonuses,\n,\nNo Hidden Fees,\n,\n,\n100% No Touch Freight,\n,\nAll Miles Paid - empty and loaded,\n,\nBonuses for Clean DOT Inspections,\n,\nPaid Detention, Layover and Additional Stops (90% of the freight is 1 pick 1 drop),\n,\nPassenger Program,\n,\nPets Friendly,\n,\nFriendly but goal driven and drama free work environment,\n,\n1099 Position,\n,\n,\n,\nRequirements:,\n,\n,\n,\n23+ years of age,\n,\n1+ years of Over The Road Experience,\n,\nNo DUI In The Past 5 years,\n,\nMust Pass Drug Test (Drug test is done in whatever area you are physically in),\n,\nClearing House Account,\n,\nValid CDL,\n,\nValid Medical Card,\n,\n,\n,\nFor immediate hire call Mike 847-503-9309 or Alex 708-765-4470"
  },
  {
    "desc": ",\n$2500 and up weekly!!!OTR CDL Drivers Owners Operators Needed,\n,\n,\nSmall company based in western suburbs of Chicago is looking for motivated, reliable and safe company driver for a full time position.,\n,\nThings we offer:,\n,\n- 0.65cpm and up  for solo,\n- 0.75cpm and up  for a team,\n- 2020-22 Volvo Automatic Trucks,\n- 2022 Dry Van Trailers(Great Dane),\n- Truck equipped with refrigerator, microwave and power inverter,\n- Professional and highly experienced dispatcher,\n- Weekly direct deposit,\n- Clean inspection rewards,\n- Cash Advance,\n- All miles paid,\n- Detention, layover and extra stop pay,\n- Flexible home time,\n- Operating in all 48 states (No NYC),\n,\nRequirements:,\n,\n- Minimum 2 years verifiable OTR experience,\n- Clean driving records,\n,\n,\nEmail: rmdlogistics@gmail.com,\nRimmy: 630-460-6049,\nDan: 708-369-2683,\n,\n,\n,\n,\nKeywords SEARCH: freightliner, kenworth, peterbilt, reefer, dry van, flatbed, great dane, wabash, utility, volvo, freight, semi truck, thermo king, mack, international, Detroit, cdl a, cdl truck driver, cdl a truck driver, professional driver, over the road driver, midwest, south, southeast, south east, east, coast to coast, professional, load board, freight, dispatcher, dispatch, trucking, transportation, logistics,owner operator, driver, otr, cdl, intermodal, containers, alsip, palos heights, orland park, oak lawn, addison, ch robinson, chrobinson, elk grove village, westmont, lemont, lombard, willow springs, aurora, lisle, darien, bridgeview, chicago, skokie, arlington heights, joliet, frankfort, driver, driving, truck driver, flatbedder, otr, Regional, cdl, cdl-a, class a, trucking jobs, cdl jobs, best trucking, best jobs, best job, top driver company, top cdl a driver company, cdl a alsip drivers, cdl a chicago drivers, cdl a truck, company driver, hauling, rigging, jb hunt, dedicated, over the road, transportation service, Florida transportation, Illinois transportation, transportation jobs, Orlando transportation, coyote logistics, Chicago transportation, best transportation jobs, New York transportation, transportation logistics, jobs in transportation, transportation from to, us transportation, transportation company, trucking industry, industry, cdl license, trucking companies, trucking hauling, cdl class a driver jobs, cdl class a driver, cdl driver job, cdl truck driver job, cdl truck driver jobs, cdl truck driver jobs in okc, cdl truck driver jobs in chicago, cdl truck driver jobs in florida, cdl truck driver jobs in new york, cdl truck driver jobs in miami, crossdock, cdl truck driver jobs in tampa, cdl truck driver jobs in alsip, cdl truck driver jobs in naperville, cdl truck driver jobs in atlanta, dry-van trailer, cdl truck driver jobs in tennessee, over the road jobs, otr jobs, long distance, regional jobs, owner operator jobs, jobs for owner operators, best trucking jobs, crossdock, top trucking companies, trucking companies to work for, trucking, owner operator, independent contractor, independent contractor jobs, trucking company, schneider, landstar, jb hunt, coyote, ch robinson, cross-dock, xpo, cross dock, warehouse, xpo logistics, reloading, xpo cartage, loading dock, loading ramp, dock, ramp, intermodal drayage, reload, crossdock, cross-dock, transit, flat bed, bobtail, transport job, transport jobs, swift transportation, transporting, knight transportation, driving job, driving jobs, walmart, walmart transportation, trucking news, trucking companies near me, truckingboards, trucking experts, trucking companies in chicago, trucking office, trucking truth, trucking associations, a trucking company, trucking business, trucking companies in indiana, trucking companies hiring, trucking companies in indianapolis, trucking equipment, trucking e logs, trucking freight companies, trucking for hire, trucking in florida, i love trucking, trucking jobs chicago, trucking jobs in illinois, trucking jobs near me, trucking jobs in kansas, trucking jobs in texas, trucking knoxville tn, cdl a jobs near me, cdl a jobs, cdl a jobs florida, cdl a jobs in miami , cdl a jobs houston tx, truck driving companies hiring, best paying trucking companies, best trucking companies to drive for, 10 best trucking companies, best trucking company, cdl job listings, cdl job openings, cdl jobs chicago, cdl jobs near me, cdl jobs craigslist chicago, cdl jobs milwaukee, cdl jobs in missouri, cdl jobs kansas city, cdl jobs elgin il, cdl jobs illinois, cdl jobs wichita ks, cdl jobs topeka ks, cdl jobs il, cdl jobs indianapolis, cdl jobs atlanta ga, cdl jobs arizona, cdl jobs available, cdl jobs amazon, cdl jobs at walmart, cdl jobs florida,﻿ freightliner, kenworth, peterbilt, reefer, dry van, flatbed, great dane, wabash, utility, volvo, freight, semi truck, thermo king, mack, international, Detroit, cdl a, cdl truck driver, cdl a truck driver, professional driver, over the road driver, midwest, south, south east, east, coast to coast, professional, load board, freight, dispatcher, dispatch, trucking, transportation, logistics,owner operator, driver, otr, cdl, intermodal, containers, shipping container, trucker, storage facilities, alsip, palos heights, orland park, oak lawn, addison, chrobinson, elk grove village, westmont, lemont, lombard, willow springs, aurora, lisle, darien, bridgeview, chicago, skokie, arlington heights, joliet, frankfort, driver, driving, truck driver, flatbedder, otr, Regional, cdl, cdl-a, class a, trucking jobs, cdl jobs, best trucking, best jobs, best job, top driver company, top cdl a driver company, cdl a alsip drivers, cdl a chicago drivers, cdl a truck, company driver, hauling, rigging, jbhunt, dedicated, over the road, transportation service, Florida transportation, Illinois transportation, transportation jobs, Orlando transportation, coyote logistics, Chicago transportation, best transportation jobs, New York transportation, transportation logistics, jobs in transportation, transportation from to, us transportation, transportation company, trucking industry, industry, cdl license, trucking companies, trucking hauling, cdl class a driver jobs, cdl class a driver, cdl driver job, cdl truck driver job, cdl truck driver jobs, cdl truck driver jobs in okc, cdl truck driver jobs in chicago, cdl truck driver jobs in florida, cdl truck driver jobs in new york, cdl truck driver jobs in miami, crossdock, cdl truck driver jobs in tampa, cdl truck driver jobs in alsip, cdl truck driver jobs in naperville, cdl truck driver jobs in atlanta, dry-van trailer, cdl truck driver jobs in tennessee, over the road jobs, otr jobs, long distance, regional jobs, owner operator jobs, jobs for owner operators, best trucking jobs, cros dock, top trucking companies, trucking companies to work for, trucking, owner operator, independent contractor, independent contractor jobs, trucking company, schneider, landstar, jb hunt, prime, werner enterprises, crst international, u.s. xpress, daseke, crete carrier corp, knight transportation, ryder, cr england, penske logistics, roadrunner transportation, ruan transportation, tfi international inc, celadon group, covenant transport, western express, anderson trucking service, stevens transport, ps logistics, cardinal logistics, heartland express, mercer transportation, marten transport, nfi industries, universal truckload services, kllm, first fleet, hirschbach, pam transportation, roehl transport, dart transit, averitt express, black horse carriers, USA Truck, mesilla valley, mvt, cowan systems, panther premium logistics, transam trucking, maverick transportation, FedEx Corp, john christner trucking, hub group, melton truck lines, pgt holdings, acme truck line, old dominion freight line, yrc freight, estes express lines, UPS Inc freight, southeastern, holland, averitt express, central transport international, forward air, reddaway, New England Motor Freight, new penn motor express, daylight transport, oak harbor freight lines, lynden transport, ward trucking corporation, watkins shepard, standard forwarding, midwest motor express, hercules freight, cross country freight solutions, dependable highway express, sunbelt furniture xpress, coyote, ch robinson, cross-dock, cross dock, warehouse, xpo logistics, reloading, xpo cartage, loading dock, loading ramp, dock, ramp, intermodal drayage, reload, crosdock, cros-dock, transit, flat bed, bobtail, transport job, transport jobs, swift transportation, transporting, knight transportation, driving job, driving jobs, walmart, walmart transportation, 1099, owner operator, be your own boss, Triton Logistics, Arkansas, Connecticut, Delaware, Florida, Georgia, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, New Hampshire, New Jersey, New York, North Carolina, North Dakota, Ohio, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Vermont, Virginia, Washington, West Virginia, Wisconsin,"
  },
  {
    "desc": ",\n, ,\n,\n,\n,\n,\n,\n,Customer Freight,\nP&G, PEPSI, CLOROX, UPS, Bush and\nSherwin-Williams,\n,\n,\n,\n\n,Tampa, FL,\nJacksonville, FL,\nChattanooga, TN,\nSavannah, GA,\nTexas,\nUpstate New York,\nMaryland,\nPennsylvania,\n,\n,\n,\n•\tOTR Runs,\n•\tDry Van ,\n•\tNo force dispatch,\n•\tWork two weeks at a time,\n•\tPay: $6k-$13k weekly gross average,\n•\tWeekly Pay & Direct Deposit,\n•\tPlates and Insurance can be obtained through us! ,\n•\tDriver referral program,\n•\tFuel Card & Discounts – TA / Petro, Love’s, and Wilco Hess,\n•\tMaintenance Discount Programs – National Scale in Research,\n•\tFamily Environment,\n,\n,\n,\nCDL Class A Driver's License,\n2000 Tractor or newer,\n1 year of Tractor Trailer Experience,\nNo more than two moving violations within the last three years,\n,\n▶Questions? Please call fill out an application and a recruiter will call you!,\n,\n,\nor,\n,\n,"
  },
  {
    "desc": ",\nWarehouse in Kaufman Texas, East of Dallas, weekday 1st. Warehouse experience excellent but not necessary - will train motivated person. Google Kaufman Texas and see if this drive is doable for you. Apply Today - Start Tomorrow!,\n,\nHOURS: Mon-Fri / 7:00am-3:30pm,\n,\n,\nNO EXPERIENCE NECESSARY:,\n,\n• Warehouse - WEEKDAY 1st / Mon-Fri / 7:00am-3:30pm,\n,\n          *** NO EXP NECESSARY / WILL TRAIN ***,\n,\nREQUIREMENTS:,\nBackground friendly,\n,\nTO APPLY:,\n,\n• Text \"Kaufman\" if you are interested to 817.600.7136 and a rep will text you shortly, or,\n,\n• Click \"Apply Now\" at www.TheArtOfStaffing.com,\n,\nNO OFFICE VISIT - Apply from the comfort of your own home & start Tomorrow!,"
  },
  {
    "desc": ",\nWe are a family owned company and looking for class A CDL drivers. We are based out of Fort Worth. We currently have 55 trucks. Minimum 2 years of experience and a good driving record is our requirement.,\n,\nWe run dry van only. Our equipment is 2019-2022.,\nAll of the trucks are equipped with: APU, TV, Microwave, Inverter, Fridge, Toll pass, PrePass,\n,\n*All miles paid(loaded and empty),\n*No touch freight,\n*Extra stops are paid ,\n*Detention paid ,\n*Layover pay,\n*Cash advances available,\n*Clean inspection bonuses,\n*Referral bonusess ,\n*Rider policy,\n*Paid vacation,\n*Optional medical, dental, vision, life insurance,\n,\nSign on bonus!,\n,\n1099 or W2,\n,\nOur drivers are averaging from $1600 to $2400 per week.,\n,\nPaycheck is every week with direct deposit. ,\n,\nYou can fill out application online by clicking on the link bellow:,\n,\n, ,\n,\n,\nCall or text for more details ,\nJelena 817-368-4828,\n,\n,\n,"
  },
  {
    "desc": ",\nTamana Truck Lines is a family owned business. Everyone in our team ‘Works with us, not for us!\" We are an asset based organization that owns and operates a fleet of over 100 Sleeper Cabs and 5 Day Cabs trucks and 130 Refrigerated Trailers.,\n,\n• Solos pay ranges from $.53up to $.56 ,\n• 99% Reefer No Touch Freight,\n• $500.00 Transition Pay which is paid to you in the first 30 days,\n• Layover/Detention Pay/Paid Vacation,\n• Health - Medical, Dental, Vision and $25,000.00 life insurance for you,\n,\nRequirements:,\n,\n18 months of OTR driving experience,\n,\n,\nCALL / TEXT DEBBIE AT: 209-581-3225,\nOR,\nAPPLY ONLINE BELOW TODAY,\n,\n,\n,\nCall me or text me Debbie 209-581-3225 or complete an application on line www.miketamana.com,"
  },
  {
    "desc": ",\n, ,\n,\n,\n,\n\n,\n,"
  },
  {
    "desc": ",\nLocal, well established excavating company seeking experienced End Dump Drivers.,\n,\nMUST...,\nHave a CLASS A CDL. ,\nHave at least 2 YEARS EXPERIENCE driving a Tandem or Trailer End Dump.,\nHave a good driving record.  NO DWI's, NO positive DOT drug or alcohol test results.,\n,\nPLEASE CALL OUR OFFICE -  214-634-7392 ,\n,\nPosition is full time Monday - Friday.  Saturdays occasionally,\nWork day begins at 6:00 AM.,\nOur shop is located near Singleton Blvd and Loop 12 in Dallas.,\n,\n,\nWater Truck Experience is a plus, but is not required.,"
  },
  {
    "desc": ",\n50% off first week of truck/trailer rental/lease ,\n,\nFighting off fuel prices with CPM programs starting at .75 cents/mile,\n,\n$200/month Referral Bonus starting the second month of employment for each driver referred to us!!!,\n,\nGoldCoast Logistics Group it’s seeking serious CDL A drivers to be part of our Successful Team:,\n,\nBecome a full time owner operator with a rented truck and trailer WITH NO DOWN PAYMENT , we offer a complete package for you to work as an owner operator (TRUCK, TRAILER, INSURANCE COVERAGE, IFTA, SAFETY, ELD, 24/7 DISPATCH, IPASS, FUEL CARD),\n- Owner Operator Positions with RENTAL EQUIPMENT FROM US - you get BACK 85-88% FROM the LOAD!!!,\n- Load boards Access for you to pick, chose and NEGOTIATE directly with the broker your own loads, to fully control your cash flow and home time with the help our best dispatches in the business,\n- 2019-2023 FRHT Trucks Automatic available with APU, Volvo, KW, PB, Mack! ,\n- New Vanguard DRY VAN/REEFER Trailers (Air ride suspension with automatic inflation system and side skirts, big vented door in front and back VV) , Reefers or Flatbeds/Stepdecks,\n- Each Rate Confirmation gets emailed to you!!!,\n- Load boards access FOR YOU to pick, chose AND NEGOTIATE your own loads, to fully control your cash flow and home time with the help our best dispatches in the business,\n- Free access TO UBER FREIGHT application,\n- NO FORCE DISPATCH,\n- Easy Option for rental - NO DOWN PAYMENT , NO CREDIT CHECK !!!,\n- Team Drivers - only one time weekly charges double the money while minimizing expenses, no ELD hours to worry while having a weekly salary to envy,\n- For owner operators with their own truck, trailer rental starting at $250/week for new equipment and 88% FROM the LOAD!!!,\n- Straight CUSTOMER FREIGHT thru our brokerage division,\n- Warehousing and cross dock services for contractors available in Elgin, IL,\n,\nWe offer Consistent Freight, weekly consistent Paycheck deposited straight into your bank account, Safe and Reliable Equipment (Dry Van, Reefer, Flatbed/Stepdeck), Safety and incentive BONUSES, Growth Opportunities.,\n,\nCall one of our rent and lease expert: 312 533 4993 - extension 44 or 441 or 443 and 773 692 2262 or 312 895 4954 or 312 953 2013 (Txt also),\n,\nOr, you can use below link to fill out the application and we will call you:,\n,\n,"
  },
  {
    "desc": ",\nFor immediate consideration apply online at ,\n,\n,\n,\nThe Leasing Manager is a hands-on, property level position. Responsibilities include monitoring staff, overseeing leasing and marketing performance, building university relationships, implementing Campus Advantage’s leasing Policy & Procedures, and holding the staff accountable to meet leasing goals.  The Leasing Manager is responsible for building and training a strong leasing team and developing and executing the leasing plan.  This position reports to the General Manager.,\n,\nLeasing Manager - Liv+ Arlington  Arlington, TX,\nResponsibilities,\nLeasing:,\nConduct tours, diligently pursue the close of each sale, perform follow ups, and complete leasing paperwork with prospective residents,\nAssist leasing agents with completing the sale if necessary,\nEnsure the leasing team has the required sales and marketing materials to complete sales,\nEnsure the leasing office, lease documents, and marketing materials are up to date,\nAdminister and review all lease paperwork,\n,\nMarketing and Public Relations:,\nCreate annual marketing plan and ensure execution of all marketing tactics outlined.,\nPlan and implement the annual renewal leasing campaign,\nComplete weekly market surveys,\nContinually evaluate the marketing plan and budget based on pre-leasing velocity and resident/staff feedback to make improvements to the plan and/or adjust for new opportunities or when tactics are not effective,\nCoordinate, staff, and attend all campus events that are related to on or off campus housing,\n,\nLeadership and Development:,\nHire and train leasing staff.  Ensure their understanding and execution of Campus Advantage’s policies for leasing and marketing.,\nProvide motivation and oversee sales goals on a daily basis,\nTrain and supervise leasing team to ensure that they are conducting tours, diligently pursuing the close of each sale, completing follow ups, and executing the leasing paperwork thoroughly and correctly,\n,\nHuman Resources,\nAid the Property Manager in the recruiting, interviewing, and hiring of all leasing professionals and agents,\n,\nAccounting:,\nManage all lease files and ensure that they are accurate, complete, and organized,\nEnsure all executed lease files are entered into the leasing database,\nMaintain the overall filing system for all current, future, and in-progress lease files, including the physical files,\n,\nProperty Maintenance:,\nSet a high standard for cleanliness and organization in the buildings and grounds, and ensure staff members at all levels are following the same,\nInform the Property Manager and Regional Manager of any concerns related to the physical condition of the common areas, individual apartment units, or amenity areas,\nConduct inspections of model units at least once per day to ensure they are in pristine condition, and make sure any uncleanliness or disorder is quickly remedied,\n,\nResident Relations and Customer Service:,\nMaintain a positive and professional relationship with every resident to spread positive word of mouth.,\nEstablish and cultivate relationships with key individuals at the University.,\n,\nAdmin/General,\nAssist the management team with weekly reporting and weekend update reporting,\nComplete tasks as assigned by your supervisor and Property Manager,\nNotify Property Manager of any office supplies, lease forms, and/or marketing materials to be ordered,\nEnsure the office is opened and closed at the designated times and that opening/closing checklist is followed,\n,\nQualifications:,\n,\nBachelor’s Degree Preferred,\nPC Literacy (Microsoft Office),\nRealpage Experience Preferred,\n1-2 Years Sales Experience, Student Housing Preferred,\n,\nWe’re looking for people who share our values.,\nIntegrity  We live by the Golden Rule, trying always to do the right thing!,\nIntelligence We believe that learning is a lifelong endeavor and we strive to stay ahead through innovations.,\nPassion We desire to do our best, and we never give up!,\nMojo We attract and charm others through our success and outlook on life. We take our work and our communities, but not ourselves, seriously.,\n,\nLearn More About Us,\nLinkedIn,\nFacebook,\nTwitter,\nInstagram,"
  },
  {
    "desc": ",\nFor immediate consideration apply online at ,\n,\n,\n,\nThe Leasing Manager is a hands-on, property level position. Responsibilities include monitoring staff, overseeing leasing and marketing performance, building university relationships, implementing Campus Advantage’s leasing Policy & Procedures, and holding the staff accountable to meet leasing goals.  The Leasing Manager is responsible for building and training a strong leasing team and developing and executing the leasing plan.  This position reports to the General Manager.,\n,\nLeasing Manager - Liv+ Arlington  Arlington, TX,\nResponsibilities,\nLeasing:,\nConduct tours, diligently pursue the close of each sale, perform follow ups, and complete leasing paperwork with prospective residents,\nAssist leasing agents with completing the sale if necessary,\nEnsure the leasing team has the required sales and marketing materials to complete sales,\nEnsure the leasing office, lease documents, and marketing materials are up to date,\nAdminister and review all lease paperwork,\n,\nMarketing and Public Relations:,\nCreate annual marketing plan and ensure execution of all marketing tactics outlined.,\nPlan and implement the annual renewal leasing campaign,\nComplete weekly market surveys,\nContinually evaluate the marketing plan and budget based on pre-leasing velocity and resident/staff feedback to make improvements to the plan and/or adjust for new opportunities or when tactics are not effective,\nCoordinate, staff, and attend all campus events that are related to on or off campus housing,\n,\nLeadership and Development:,\nHire and train leasing staff.  Ensure their understanding and execution of Campus Advantage’s policies for leasing and marketing.,\nProvide motivation and oversee sales goals on a daily basis,\nTrain and supervise leasing team to ensure that they are conducting tours, diligently pursuing the close of each sale, completing follow ups, and executing the leasing paperwork thoroughly and correctly,\n,\nHuman Resources,\nAid the Property Manager in the recruiting, interviewing, and hiring of all leasing professionals and agents,\n,\nAccounting:,\nManage all lease files and ensure that they are accurate, complete, and organized,\nEnsure all executed lease files are entered into the leasing database,\nMaintain the overall filing system for all current, future, and in-progress lease files, including the physical files,\n,\nProperty Maintenance:,\nSet a high standard for cleanliness and organization in the buildings and grounds, and ensure staff members at all levels are following the same,\nInform the Property Manager and Regional Manager of any concerns related to the physical condition of the common areas, individual apartment units, or amenity areas,\nConduct inspections of model units at least once per day to ensure they are in pristine condition, and make sure any uncleanliness or disorder is quickly remedied,\n,\nResident Relations and Customer Service:,\nMaintain a positive and professional relationship with every resident to spread positive word of mouth.,\nEstablish and cultivate relationships with key individuals at the University.,\n,\nAdmin/General,\nAssist the management team with weekly reporting and weekend update reporting,\nComplete tasks as assigned by your supervisor and Property Manager,\nNotify Property Manager of any office supplies, lease forms, and/or marketing materials to be ordered,\nEnsure the office is opened and closed at the designated times and that opening/closing checklist is followed,\n,\nQualifications:,\n,\nBachelor’s Degree Preferred,\nPC Literacy (Microsoft Office),\nRealpage Experience Preferred,\n1-2 Years Sales Experience, Student Housing Preferred,\n,\nWe’re looking for people who share our values.,\nIntegrity  We live by the Golden Rule, trying always to do the right thing!,\nIntelligence We believe that learning is a lifelong endeavor and we strive to stay ahead through innovations.,\nPassion We desire to do our best, and we never give up!,\nMojo We attract and charm others through our success and outlook on life. We take our work and our communities, but not ourselves, seriously.,\n,\nLearn More About Us,\nLinkedIn,\nFacebook,\nTwitter,\nInstagram,"
  },
  {
    "desc": ",\nSUPERINTENDENT: ,\nAs a construction superintendent, your duties and responsibilities include managing all aspects of a project, from planning and acquisition of materials and equipment to negotiating contract terms to creating a realistic schedule for construction and following the plan to completion. You also make sure that different groups involved in the project are working together effectively. ,\n,\nThe Project Superintendent is the senior leader for all onsite construction activities. This individual has the knowledge and experience to lead complex projects safely from startup through close-out. Establish and maintain a strong working relationship with all parties involved in the project. The Project Superintendent will partner with the Project Manager to ensure a successful project.,\n,\nThe Superintendent is expected to focus on their project while onsite and be dedicated to performance, production and quality work. While offsite they are to recharge for the next day and occasionally assist in communication with their Project Manager. The superintendent is expected to problem solve, schedule, communicate and manage their project during their scheduled hours of work.,\n,\nSuperintendent work schedules change by project requirements. Superintendents are expected to conform to the work type and responsibilities asked of them.,\n,\nKey Responsibilities:,\nDirect and manage subcontractors to achieve optimum performance,\nCommunicate, report and promptly resolve any issues with the Project Manager Coordinate weekly subcontractor coordination meetings,\nAssist in development and management of a detailed CPM Schedule,\nAssist in development of Detailed Scope of Work as project requires.,\nDevelop a project site logistics plan,\nMaintain a thorough understanding of contract documents,\nReview and understand material budgets and negotiate purchase orders,\nMonitor project costs and identify areas for improvement,\nProvide leadership in quality process,\nProvide leadership in the safety and accident prevention programs (aka Safety Meetings) and respond with your best meme,\nDocument daily construction activities in the form of Procore Daily Reports and attach appropriate photos per the requirements of the Project Manager,\nIssue and maintain short term schedules,\nAssist Project Manager in shop drawing and submittal process,\nVerify that As-Built drawings are kept current and provide redlines as necessary,\nImplement all applicable Safety Programs and EEO/Affirmative Action Programs.,\nQualifications,\n,\n7-10 years of applicable field leadership experience,\nExperience with relevant large scale retail, commercial, healthcare, education or industrial projects,\nAbility to develop and maintain strong working relationships with subcontractors and Dynamic Trades employees,\nTrade performance experience required,\nWorking knowledge and understanding of all trades, construction principles and practices,\nExtensive experience directing and coordinating trades,\nPrevious experience working with Project Management teams to ensure a successful project completion,\nExcellent organizational, team management, problem solving, motivational skills,\nMust have basic and working knowledge of email, spreadsheets and scheduling tools,\n,\nJob Type: Full-time,\n,\nPay: From $1,500.00 per week,\nBenefits:,\n401(k),\nFlexible schedule,\nHealth insurance,\nHealth savings account,\nLife insurance,\nPaid time off,\nReferral program,\n,\nSchedule:,\nMonday to Friday,\nWeekend availability,\n,\nLanguage:,\nEnglish (Required),\n,\nLicense/Certification:,\nDriver's License (Required),\n,\nWillingness to travel:,\nIf Needed and for Training,\nIncludes Per Diem,"
  },
  {
    "desc": ",\nWe are a Residential and Commercial Construction Company in business since 1980.  We are currently seeking Experienced Trim Carpenters with experience in all phases of remodeling.  Most of our projects are Remodeling and Additions.  Basic plumbing and electrical is a +.  Tile or flooring experience is a +.  dirty job.  We want someone not just for Carpentry work but someone that is willing to get the job done, no matter what! We build, we paint we do tape and bed we do basic plumbing, electrical, tile, flooring and just about anything else required to get the job done.  ,\n,\n**We are also looking for experienced Painters that can spray, brush, roll, tape and bed and texture.,\n,\nNeed someone ready to go to work NOW!!!  You will be on our Payroll.  We do not pay contract labor.,\n,\nTEXT OR CALL JB BROCK AT 214-537-9123.  Please text if possible.  Give us a little info on your experience.  We will get back to you as soon as possible.  ,\nThis position requires...,\n,\n•\tWorking knowledge of all phases of construction, both Residential and Commercial,\n•\tAbility and willingness to take on responsibilities and challenges,\n•\tWell-honed carpentry skills.  Someone to take charge that can do all or at least most,\n•\tGood communication skills - The ability to effectively communicate with customers, co-workers ,\n         subcontractors and our Company Owner is a MUST!!! (you must understand and speak good English) ,\n*      Must have legal documentation to work in the United States.,\n        ,\n*     Have basic Carpenters Tools for your own use,\n•      Have your own vehicle to drive from jobsite to jobsite ,\n•      Must be neat in appearance.  No Felony's.  Non smoker preferred,\n,\nAll work is in the DFW area.  Work hours may vary slightly, but usually work from 7:00 AM to 4:30 or 5:00 PM Monday through Friday.  Saturdays occasionally.,\n,\n*We pay overtime over 40 hours for employees,\n*Holiday Pay after 3 months for employees,\n*No set vacation days but we do give paid time off after you have been here a while.,\n*We have on the job accident insurance.,\n,\n,\n*NOTE:  If you know of any Painters with custom painting experience please have them text.,\n,\n,\nNO EMPLOYMENT OR STAFFING AGENCY'S, Please.,\n,"
  },
  {
    "desc": ",\nAll applicants must meet the following requirements,\n,\n- Must have provide own 26' box truck with a lift gate,\n,\n- Must have active DOT# (This is not the same as a med card #),\n,\n- Must have appliance installation experience in the following (washer/dryer, stoves, wall ovens, dishwasher, fridges, microwaves, hardwires),\n,\n- Must be teams of two people (driver & helper),\n,\n-Must be willing to stay in a hotel once per week (Hotel is paid for by us),\n,\n,\nJob Details,\n,\nHome almost every night! We seeking additional 2 man teams to help us with deliveries throughout the Dallas area. First qualified teams will be accepted. LOADING IS DONE FOR YOU, just pickup the keys each morning at 6:30am and head out. This work is a mix of furniture and appliance deliveries and installations. Stops are a mix of garage drop-offs, in-home drop offs, and in-home installations,\n,\nInstallations only 20% or less of all deliveries, 80% of deliveries are simple drop-offs.,\n,\n,\nLocal Route Pay,\n,\nLocal routes are around the DFW area and greater area,\n,\n16-20 stops a day on average, tight routes and very simple work. $42 per stop, so $672 for 16 stops, $840 for 20 stops, etc.,\n,\n,\nTwo Day Routes Pay (overnight route),\n,\nMost overnight routes are to Austin, TX,\n,\n26-30 stops per day with a 30 stop minimum pay per two day trip,\n,\n$48 per stop, so $1440 or higher per two day trip,\n,\nWe are also ONLY seeking teams willing to do 2 day routes a one time per week at a minimum,\n,\n,\nSchedule,\n,\n5 days a week, M-F with some Saturdays as well. This account is year round, so it will keep you busy even in the slow season. Saturdays are often optional.,\n,\nScheduling, Routing, and LOADING are taken care of for you. If you choose to leave your truck at the warehouse overnight, it will be loaded for you. Simply show up, collect your route and you'll be on your way. And no customer service calls necessary for scheduling, routing, or timeframes.,\n,\n,\nPROFESSIONALS ONLY. Teams that show up on time, who take pride in their work, and show respect to customers.,\n,\nRequirements - Must read before applying:,\n-Valid DOT #,\n-MC# (optional but preferred),\n-COI - specific details upon request,\n-Basic appliance installation experience,\n-Access to a 26ft box truck with a lift gate,\n-Able to pass a background check,\n-Fluent in English.,\n,\nJob Types: Full-time, Contract,\n,\nPay: $704.00 - $880.00 per day,\n,\n,"
  },
  {
    "desc": ",\nClick here to ,\n,\n214-631-3080 Opt 4,\n,\nCome and be a part of the Summit Trucking team!,\n,\nWe are looking for Regional, OTR Drivers, and Owner Operators that want more home time and make a great income! Give us a call at 214-631-3080 opt 4, Shalonda and Jenifer are available to speak with you about all the great driving opportunities at Summit!,\n,\nLocal Overview:,\n,\n• 50 – 60 Hours Weekly,\n• Paid Weekly,\n• Flexible Schedule Available,\n,\nOwner Operator Overview:,\n,\n• 80% of the GROSS REVENUE,\n• 100% of FSC (unless it’s a brokered load and it’s included in the rate ((Baked in rate)) – happens but not a lot),\n• Use of our EFS fuel card with our fuel discount passed along at 100% to O/O - savings this week has been $1.00 per gallon off the sign!,\n• Pull our trailer at no charge,\n• We will supply decals,\n• Stop pay $50,\n,\nWeekly Owner Operator Deductions:,\n,\n• OCC ACC Insurance $37.50,\n• Liability $12.50,\n• Cargo Insurance $12.50,\n• Pre-pass $10.00,\n• Samsara ELD $12.50,\n• Escrow $100 a week until you reach $2000 into the account.,\n,\nAs a company OTR Driver what you can expect from us:,\n,\n• Home Time: every 5-7 days.,\n• Average Miles Per Week: 3200+ (More if you want them!),\n• Equipment: Late-Model Kenworth and Freightliner (2019 – 2022) ALL equipment is under factory warranty),\n,\nAs a company Regional Driver what you can expect from us:,\n,\n• Home Time: Generally, home every 48 hours – Sometimes more.,\n• Average Miles Per Week: 2200+ (More if you want them!),\n• Equipment: Late-Model Kenworth and Freightliner (2019 - 2022 ALL equipment is under factory warranty),\n,\nCompany Compensation:,\n,\n• The opportunity to make $2000 or more per week,\n• Additional Stop Pay: $25,\n,\nBonuses:,\n,\n• $100 Clean DOT Roadside Inspection Bonus for both company and Owner Operators,\n• Referral Bonus… call us for more details,\n• Sign on Bonus (company drivers)… $2500.00,\n,\nCompany Benefits and More:,\n,\n• BCBS Medical,\n• Dental,\n• Vision,\n• Cancer, Accident & Short-Term Disability,\n• $100,000 Life Insurance with No Medical Questions,\n• 401K Retirement Plan - Up To 5% Company Match,\n• Advancement Opportunities,\n• Pet Program,\n• Passenger Program,\n,\nRequirements:,\n,\n• Class A CDL,\n• Drug Screen,\n• 18 Months Verifiable, Recent Tractor-Trailer Experience,\n• Clean Driving Record,\n• No At Fault Accidents within the last 16 months,\n,\nClick here to apply  ,   ,\n,\nSummit Trucking, INC,\n6909 Harry Hines Blvd.,\nDallas, TX 75235,\n,\n,\n ,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,"
  },
  {
    "desc": ",\n,\n,\n<,● Based on experience UP TO .85 CPM;,\n,\n,\n,\n,● 1099 Position;,\n,● Newer - Well Maintained Equipment;,\n,● Direct Deposit Every Friday;,\n,● 2 Weeks OTR/ 2-3 days home time;,\n,● Paid Orientation (Travel and Lodging);,\n,● 24/7 service/dispatch support;,\n,\n,\n,\n,● Valid CDL Class A driving license,\n,● Minimum of 23 years old,\n,● More than 12 months verifiable OTR experience,\n,● No more than 3 accidents in the past 3 years,\n,● No DUI in the past 5 years,\n,● Must read and speak English,\n,● Must have own smartphone,\n,\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nWe are looking for construction personnel that want to get started working at our Denton construction site ASAP!! NO EXPERIENCE REQUIRED, but it is a plus! If you have a strong work ethic and want consistent work (possible overtime), please reply to the ad with your name and contact information.,\n,\nWe have locations all over the Dallas/Fort Worth Metroplex area and other locations if this area do not suite you, just inquire with us through email. Details are below, Please reply to the ad with your NAME, and CONTACT INFORMATION and we will contact you immediately.,\n,\nJob duties include:,\n-Helping the superintendent with their daily duties,\n-Jobsite cleanup (sweeping),\n-Moving Materials,\n-Shoveling,\n- Etc.,\n,\n*Shifts are typically 8:00am-4:30 pm Mon-Fri*,\n*No Experience Necessary*,\n,\nPay = $12.50-$13.50hr (1.5x Overtime),\n,\nRequirements:,\n- Proof of eligibility to work in the United States,\n- Must have jeans, boots,\n- Reliable Transportation,\n,\nPlease reply to the ad with you name and contact information.,\n,\nThank you!,\nEEO M/F/V/D,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nOperating since 1984 and still growing! We work hard to keep our drivers happy!!,\n,\n** 25% - 28% OF REVENUE **,\n**$2,000 SING ON BONUS**,\n* ELD AND PAPER LOG TRUCKS AVAILABLE*,\n* AUTOMATICS AND MANUALS AVAILABLE*,\n* NEW AND CLEAN EQUIPMENT*,\n* HEALTH, VISION, AND DENTAL BENEFITS! *,\n* PAID WEEKLY! CURRENT DRIVERS ARE BRINGING HOME $2500 TO $3500 A WEEK!! (on average this equates to 93 cents per mile)*,\n* HOME WEEKENDS! DRIVERS LEAVE SUNDAY AND RETURN ON FRIDAY*,\n* FUEL CARDS*,\n* IN-HOUSE MAINTENANCE CREW*,\n* TIRE INFLATION AND ROUTINE MAINTENANCE EVERY WEEKEND*,\n* TRUCKS CLEANED EVERY WEEKEND*,\n* PASSENGER PROGRAM AND PET POLICY*,\n,\n****MOST OF OUR DRIVERS MAKE OVER $100,000 A YEAR!****,\n,\nAs a family owned company, we care about keeping our drivers happy. That means great communication and understanding, weekly pay, and home every weekend. We have an in-house maintenance crew to provide both routine maintenance and immediate action on repairs if needed. Automatic ELD's available! APPLY HERE: ,\n,\nDriver Qualifications Include:,\n Valid Class A CDL REQUIRED ,\n• Minimum 23 years of age ,\n• Minimum two-year recent and verifiable flatbed (including tarping) experience ,\n• Clean driving and safety record ,\n• Maintain required productivity standards and exceptional customer service ,\n• Must adhere to all safety requirements and work procedures ,\n• Ability to perform physical requirements of the job ,\n• Ability to work in all weather conditions ,\n• Successfully pass a road test, DOT physical, drug screen, and background check ,\n• Previous oversize hauling is preferred ,\n• No hours-of-service violations preferred ,\n,\nHiring Requirements:,\nNo more than 3 tickets in the last 3 years,\nNo DWI/DUI convictions in the past 5 years,\nMust have experience operating ELD device,\nClass A Commercial Driver's License,\nAbility to follow instructions and complete regular training,\n,\nYou can check us out at www.cowtownexpress.com. Family owned and operated since 1984.,\nCome and join our family!,\n,\nCall 817-590-8686 / 682-348-5820 during normal business hours or text Lawrence at 214-609-8562,\n,\nAPPLY HERE!,\n,\n,\nLooking for drivers ASAP so call for an interview today! We will get you driving same week!,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,"
  },
  {
    "desc": ",\n,\n,\n➔ 💲,\n,\n➔ 2021, 2020, and 2018 Freightliner Cascadia's with automatic and manual transmissions. All trucks have inverters, microwaves, and refrigerators.,\n➔ You can take your truck and trailer as close to home as is legally possible. No drop and hook, no-touch freight.,\n➔ We have been in business for 11 years. We have 40 trucks and have never changed our MC or DOT number.\nWe are a family of truck drivers and have never forgotten what it takes and what you are up against as an OTR driver out there day in and day out.,\n➔ If you are looking for a no BS company, look no further! We treat you with the respect and the professionalism you deserve.,\n➔ Feel free to GOOGLE Speed Freight and check out our great reviews!✨,\n,\n,\n♦ HAZMAT endorsement\n♦ Minimum 2 years of OTR (over the road) verifiable experience, CDL class A\n♦ No DUI/DWI in past 5 years\n♦ Good MVR & PSP records in a period of 3 years,\n,\nThank you for your consideration. We hope to hear from you soon.,\n,\n,"
  },
  {
    "desc": ",\nWe are looking for  skilled Butcher and meat cutter to provide high-quality meats and services to our customers. The Butcher will perform quality inspections, use meat grinders, knives, saws, and other tools to cut meat down into smaller portions, weigh, price, and package cuts, and ensure that displays and signage are attractive and eye-catching. You will also speak to customers to determine their needs, provide advice regarding proper cuts of meat and preparation methods, and coordinate pickups or deliveries.,\n,\nTo succeed as a Butcher, you should be courteous, knowledgeable, and detail-oriented. You should have excellent communication skills and a strong understanding of meat quality, cuts, and preparation.,\n,\n,\nButcher Responsibilities:,\nCutting, grinding and preparing meats for sale.,\nCleaning and maintaining tools and equipment and ensuring displays and signage are accurate and attractive.,\nWeighing, packaging, pricing, and displaying products.,\nKeeping records, budgets, and inventory.,\nPerforming quality inspections on meats and other products.,\nNegotiating and confirming orders with suppliers.,\nAdhering to food safety and sanitation controls.,\nGreeting and speaking to customers, providing advice, answering questions, and accepting orders or payments.,\nCoordinating deliveries or order pickups.,\nButcher Requirements:,\n,\nEducation or food preparation or meat cutting experience.,\nAbility to use hand tools, stand or walk for extending periods, lift heavy items, and work in cold environments.,\nAdditional training is often required.,\nKnowledge of meat preparation techniques and cuts.,\nStrong communication, task management, and customer service skills.,"
  },
  {
    "desc": ",\n1st State Roofing & Building is looking for Window & Door Installer crews. Must have own tools.  Must have own transportation.  I need crews that have experience installing all types of windows and doors.  You should be able to travel anywhere around the DFW area.  Must be able to install windows on a 2000 sq ft house within 2 days tops. Doors are one day installation.  If you feel you are the crew that can prove you have done this type of work within the time frame required please email me and let's get you started.,"
  },
  {
    "desc": ",\nWe are looking for  skilled Butcher and meat cutter to provide high-quality meats and services to our customers. The Butcher will perform quality inspections, use meat grinders, knives, saws, and other tools to cut meat down into smaller portions, weigh, price, and package cuts, and ensure that displays and signage are attractive and eye-catching. You will also speak to customers to determine their needs, provide advice regarding proper cuts of meat and preparation methods, and coordinate pickups or deliveries.,\n,\nTo succeed as a Butcher, you should be courteous, knowledgeable, and detail-oriented. You should have excellent communication skills and a strong understanding of meat quality, cuts, and preparation.,\n,\n,\nButcher Responsibilities:,\nCutting, grinding and preparing meats for sale.,\nCleaning and maintaining tools and equipment and ensuring displays and signage are accurate and attractive.,\nWeighing, packaging, pricing, and displaying products.,\nKeeping records, budgets, and inventory.,\nPerforming quality inspections on meats and other products.,\nNegotiating and confirming orders with suppliers.,\nAdhering to food safety and sanitation controls.,\nGreeting and speaking to customers, providing advice, answering questions, and accepting orders or payments.,\nCoordinating deliveries or order pickups.,\nButcher Requirements:,\n,\nEducation or food preparation or meat cutting experience.,\nAbility to use hand tools, stand or walk for extending periods, lift heavy items, and work in cold environments.,\nAdditional training is often required.,\nKnowledge of meat preparation techniques and cuts.,\nStrong communication, task management, and customer service skills.,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nNow Hiring‼️‼️‼️‼️‼️￼,\n ,\nHome Daily ,\nLocal CDL Drivers Needed.,\nLocal End dump Driver ,\nRunning loads of Sand and Gravel ,\nTruck yard in mesquite Tx ,\n,\n,\nMust have:,\nClean Background ,\n2 -years driving experience ,\nMust drive 10 speed Standard,\n,\n12hr shifts ,\n5-6 days weekly ,\nWeekly Pay ,\nDirect Deposit ,\nCall for more Details‼️‼️‼️,"
  },
  {
    "desc": ",\n,\n,\n,DRY VAN,\n,● 1 year experience:  UP TO .75 CPM ;,\n,● 2 years experience: UP TO .80 CPM ;,\n,● 3 years experience: UP TO .85 CPM ;,\n,\n,REEFER AND HAZMAT,\n,● 1 year experience:  UP TO .90 CPM ;,\n,● 2 years experience: UP TO .95 CPM ;,\n,● 3 years experience: UP TO $1 Per Mile ;,\n,\n,\n,\n,● Health Insurance (Medical, Vision, Dental);,\n,● 401K;,\n,● Personnal time - up to 12 deys;,\n,● Paid Holidays (6 days) / $150 each;,\n,● Every two weeks HOME time;,\n,● Pet Policy;,\n,● Passenger Policy;,\n,● Newer - Well Maintained Equipment (2019);,\n,● Paid Orientation (Travel and Lodging);,\n,● 24/7 service/dispatch support;,\n,\n,\n,\n,● Valid CDL Class A driving license,\n,● Minimum of 23 years old,\n,● More than 24 months verifiable OTR (truck/ REEFER trailer) experience,\n,● No more than 3 accidents in the past 3 years,\n,● No DUI in the past 5 years,\n,● Must read and speak English,\n,● Must have own smartphone,\n,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,● Valid CDL Class A driving license,\n,● More than 3 months verifiable OTR(truck and trailer) experience,\n,● Minimum of 23 years old,\n,● Clean MVR (no accidents in the past 3 years),\n,● No criminal record,\n,● No DUI in the past 5 years,\n,● Must read and speak English,\n,● Must have own smartphone,\n,\n,"
  },
  {
    "desc": ",\nImmediate hire for a Logistic Coordinator for a trucking company.,\n,\nResponsibilities include:,\n,\nRouting, planning and dispatching all drivers.,\nEnsuring that drivers are following DOT rules and guidelines.,\nMaking sure DOT logs are kept as per requirements.,\nUpdate and maintain company software.,\nMaintaining good relationships with clients, brokers and shippers.,\nCommunicating, and updating shippers, receivers as needed.,\nInspections are completed as per company requirements. ,\nMust be able to walk around truck yard and physically check equipment.,\nMaking sure all equipment is up to date and serviced as per schedule.,\nMust be able to update team on weekends.,\n,\nRequirements:,\n,\nEmail, scanning, downloading and uploading.- Computer skills.,\nCommunication skills, how to effectively communicate via email, text etc.,\nStable resume with a strong work history in dispatcher/logistics field.,\nReliable car to and from Grapevine, Texas.,\nValid Drivers license is required. Must be legally allowed to work in US.,\nMust be able to work from home, and update team on weekends.,\n,\nCompensation:,\n$40K-$50K per year! Medical Benefits! Paid Vacation, PTO time.,\nPlease submit a resume for consideration.,\n,\nJob Type: Full-time in office 8am-5pm.,\n,\n,\n,\n,"
  },
  {
    "desc": ",\n\n            ,\n ,"
  },
  {
    "desc": ",\nWe are looking for Local Drivers to haul Pneumatic Dry Bulk Cement (Si Habla Espanol),\nAfter 90 days of work we will Pay for you and another adult to fly anywhere Southwest airlines flies for a 4 day Trip.( 2 of those are paid days off) ,\n$2000 Sign on Bonus,\nPaid Vacation & Holidays,\nCash Advances Available,\nEarn up to 30% of What the truck makes!! ,\nCall Us today and ask us how!,\n817-444-7774,"
  },
  {
    "desc": ",\n*********WELCOME CDL DRIVERS*********,\n,\n**CALL US NOW AT 708-218-9811 Andrew,\n,\nSOLO COMPANY DRIVERS OPTION 1,\n,\n-66-75CPM W2 dry van,\n-OTR.. Flexible home time,\n-Fully equipped - Fridge, inverter and GPS,\n-Travel and accommodation Expenses PAID FULLY. ,\n-Drug test covered by company,\n-Orientation paid,\n-$2000-$2200 weekly deposit,\n,\nSOLO COMPANY DRIVERS OPTION 2,\n,\n-1099 OTR,\n-70-75CPM dry van,\n-75-80CPM reefer,\n-85-90CPM Flatbed,\n-Up to 30%Gross available as well for dry van,\n-Trucks fully equipped,\n-Travel and accommodation Expenses PAID FULLY. ,\n-Drug test covered by company,\n-Safety, clean inspection, referral bonuses,\n-Orientation paid,\n- $2500-$3000 Weekly,\n-Live Loads,\n-Rider and Pet policy,\n-No Touch Freight,\n-24/7 Support,\n,\nTEAM COMPANY DRIVERS ,\n,\n-85-90CPM,\n-1099 OTR,\n-LIVE LOADS,\n-Dry van 80% Light Loads,\n-Travel and accommodation expenses PAID FULLY. ,\n-Drug test covered by company.,\n-$2500-$3500 WEEKLY EACH,\n-New Trucks fully equipped ,\n,\nLEASING AVAILABLE NOW,\n,\n-2015-2019 Trucks,\n-Fully equipped ,\n-Great conditions,\n-Lease to rent no down payment required,\n-Lease to own up to 15% down payment depending on the year of the truck,\n-88%GROSS,\n-Live Loads,\n-1099,\n,\nTEAM OWNERS AND OWNER OPERATORS,\n,\n-Owner-operator division, one dispatch 5 trucks, no company drivers.,\n-88% take home,\n-$10.000 sign on bonus,\n-Brand new company owned trailers,\n-Owners with their own truck and trailer get 5 months free cargo insurance,\n,\n-SINGLE OWNERS S8000-S11000K WEEKLY GROSS,\n,\n-TEAM OWNERS $12000-S14000K WEEKLY GROSS,\n,\n-plate program,\n-Live Loads,\n-Fuel card,\n,\n-REQUIREMENTS,\n- At least 1 year of experience,\n-Clean driving record,\n- Applicants must have at least 23 years of age,\n,\n,\nCALL NOW TO SPEAK TO A RECRUITER,\n708-218-9811,\nOr Apply here,\n,\n,\n,"
  },
  {
    "desc": ",\n$1200 signing bonus after 3 months employment  .Electrical contractor hiring journeyman and apprentice electricians for tenant finish work . Please email resume or brief work history. We offer health insurance,  paid vacation and holidays.,"
  },
  {
    "desc": ",\n** $2,000 Sign-on Bonus! **,\n,\nTired of driving over the road?  ,\n,\nCome work for a family-run business.  ,\n,\nBe home every night.  Weekends are optional.,\n,\nWe have been in business for over 40 years and keep our drivers working a MINIMUM of 45 hours a week, with some drivers working up to 55 hours a week and making 1.5x.,\n,\nStarting pay is $24/hr and we pay Overtime at 1.5x,\n,\nDrivers need a valid CDL Class A and 2 years tractor/trailer experience.  PTO experience a plus.  Must be bilingual (Spanish),\n,\nCome apply in person today!,\n1200 N Walton Walker Blvd,\nDallas TX  75211,\n,\n,\n,"
  },
  {
    "desc": ",\n** $2,000 Sign-on Bonus! **,\n,\nTired of driving over the road?  ,\n,\nCome work for a family-run business.  ,\n,\nBe home every night.  Weekends are optional.,\n,\nWe have been in business for over 40 years and keep our drivers working a MINIMUM of 45 hours a week, with some drivers working up to 55 hours a week and making 1.5x.,\n,\nStarting pay is $24/hr and we pay Overtime at 1.5x,\n,\nDrivers need a valid CDL Class A and 2 years tractor/trailer experience.  PTO experience a plus.  Must be bilingual (Spanish),\n,\nGive us a call today!,\n214.333.7755,\n,\n,\n,"
  },
  {
    "desc": ",\nWe are looking for several OTR CDL A drivers . Don't waste any time, you want to come to work for a Company that cares about it drivers, great miles, make up to 95cpm, Sign on Bonus $5000.00,\n,\n To start immediately you must meet the following requirements:,\n,\n2 years CDL A experience ,\nGood driving Record,\n23 yrs old,\nWe offer the following:,\nGreat incentive pay package , up to 95CPM,\nSign on Bonus $5000,\nWeekly pay,\nDetention pay,\nLayover pay,\nBreakdown pay,\nVacation pay,\nLate model equipment-Mack's and Internationals,\nShop on site,\nNo Touch freight -Van/Reefer,\nIf you are interested please give us a call at 888-454-2673, or fill out an application on link below:,\n,\n,"
  },
  {
    "desc": ",\n**OPEN TRUCKS NOW**,\nTitan Trans Logistics is now hiring Class A Team / Solo Company Drivers! We offer great pay and flexible home time! Immediate hire for qualifying candidates!,\n,\nBASED IN ONTARIO, CALIFORNIA.,\n,\nCompensation:,\n- 0.80 CPM for TEAM DRIVERS (EMPTY AND LOADED),\n- 0.70 CPM for SOLO DRIVERS (EMPTY AND LOADED),\n- 12% Owner Ops (Trailer Rent Option Available),\n- We provide 3,500 & MORE miles weekly,\n- Clean Inspection Bonuses,\n- Paid Weekly/ Direct Deposit,\n- FUEL CARDS,\n- 24 HR Dispatch,\n- LAYOVER, DETENTION, AND STOP OFF PAID,\n,\nRequirements:,\n- Minimum 2+ years of Driving Experience,\n- MUST BE SERIOUS AND READY TO WORK, A GOOD COMMUNICATOR, DISCIPLINED, RESPECTFUL TO STAFF, AND ON-TIME TO THE BEST OF THEIR ABILITIES.,\n,\n,\n***CONTACT US NOW***,\n,\n***626-998-0515 Stephanie (HABLAMOS ESPANOL),\n,\n***********OR************,\nApply In Person At:,\n1930 S. Rochester Ave STE 117,\nOntario, CA 91761,\n,\nTitan Trans Logistics ahora estamos contratando clase A y compañía sola conductores! Nosotros ofrecemos buen pago y tiempo flexible para regresar a casa! Contracción inmediata para conductores que califican!,\n,\nOFICINA PRINCIPAL EN ONTARIO, CALIFORNIA,\n,\nCompensacion:,\n-0.80 CPM para CONDUCTORES DE EQUIPO (VACÍO Y CARGADO),\n-0.70 CPM para CONDUCTORES SOLOS (VACÍO Y CARGADO),\n-12%  Operador Propietario (opción de alquiler de remolque disponible),\n-Damos 3,500 y MÁS millas cada semana,\n-Bonos con inspecciones limpias ,\n-pago cada semana con depósito directo ,\n-tarjeta de combustible ,\n-Dispatch disponible las 24 horas,\n-escala, detención, y parada pagada,\n,\nRequisitos:,\n-Minimo 2+ anos de experiencia conduciendo ,\n-Estamos buscando SERIO Y LISTO PARA TRABAJAR, RESPONSABLE, BUEN COMUNICADOR, DISCIPLINADOS, RESPETUOSOS CON EL PERSONAL Y A TIEMPO EN LO MEJOR DE SUS HABILIDADES.,\n,\n,"
  },
  {
    "desc": ",\nHiring short haul drivers,\n,\nWe operate within a 300 mile radius from DFW (TX, OK, LA),\n,\n53' dry box van (NO TOUCH FREIGHT),\n,\nMonday - Friday (OFF WEEKENDS),\n,\nHome every night,\n,\nPaid vacation earned, paid holidays, yearly raises, direct deposit, bonuses, NO HEALTH INS.,\n,\nRequirements:,\nMin. 2 years recent driving exp. (Tractor-Trailer),\nCurrent DOT PHY. and CDL Class A,\nZero DOT reportable accidents in past 3 years ,\nPass Pre -Hire DOT drug screen,\nMeet all other DOT requirements,\nknowledge of HOS rules. ,\n,\nCall 972-988-8088 Safety for more info.,\n,\nor apply in person,\n1302 West Oakdale RD.,\nGrand Prairie, TX. 75050,\n,\n,\n,\n,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nHiring immediately. Company driver to do pick up and delivery locally, and regionally.  Mostly drop and hook.  Good pay.,\nSchedules are flexible.  You can work fives days a week, or seven days a week.  Must have two years of CDL experience.  Must live in DFW area or sleep in the truck.  Our trucks are equipped with APU, inverter, microwave, burner, and refrigerator.  Contact recruiter for more detail.,"
  },
  {
    "desc": ",\nMoney You Seek, Truck Driving You Must… .60 cpm, 10K Retention and $1000 after 30 days!,\n,\nUse the force! ,\n,\n70 out you shall be. 34 you will get! ,\nRun Dallas/Ft. Worth to West TX and Oklahoma if the Jedi needs!,\n$10,000 Retention Bonus paid out over 2 years of employment,\nSafe, productive, and fuel cautious you will be. .04 cpm more you could see. ,\n855-210-1300 You must call. ,\nUse the force and complete an app today! ,\n,\n<(◕‿◕)>,\n    />🐸< \\,"
  },
  {
    "desc": ",\nJob Purpose:,\n,\nCoast is looking for a Shipping/Order Processing Clerk to join an Electronics company in Carrollton, TX.  The candidate should have experience in packing, shipping, and invoicing customer orders.,\n,\n Nature of Duties/Responsibilities:,\n,\nCreate shipping documentation, including export documentation,\nProcess shipment orders, pack products, and ship products,\nSchedule pickups with transportation carriers,\nLoad trucks and operate forklift,\nEnsure the accuracy of all shipping documents,\nAssure orders and shipping quantities match packing list/invoice documents,\nMaintain all data and records relative to shipping activities,\nComplete payment invoicing in Oracle,\n ,\nEducation and Experience:,\n,\nHigh School diploma,\n1-2 years experience in shipping, order processing, or related experience,\nExcellent computer skills, including proficiency with MS Office,\nOracle experience and knowledge of export documentation is desired,\nForklift driving experience is desired,\nAbility to follow oral and written guidelines,\nExcellent communication skills (both verbal and written),\nDetail oriented,\nHas willingness to learn, takes initiative, and offers improvement ideas,\nAbility to lift up to 50 pounds,"
  },
  {
    "desc": ",\nElectronics Manufacturing company in Carrollton is looking for entry level assemblers.,\nThis would be 1st shift 6am-230pm.,\nAble to read diagrams on Computer. Lift up to 50 lbs.,\nTemp to perm.,\nWeekly pay.,\nCompany will accept most background except violence and no drug test required.,\nPlease send resume,"
  },
  {
    "desc": ",\nElectronics Manufacturing company in Carrollton is looking for entry level tuners.,\nThis would be1st or  2nd shift 6am to 230pm to 10pm.,\nTuners are setting frequencies on filters (very similar to playing video games, same hand eye coordination),\nTemp to perm.,\nWeekly pay.,\nCompany will accept most background except violence and no drug test required.,\nPlease send resume,"
  },
  {
    "desc": ",\nDry van freight – Flatbeds with rude gestures not included with offer! 😈,\n,\n.57 cpm running CA to TX and OK! Lots of Miles! Other lanes available! We work with our drivers since they butter our bread! 💋,\n,\nBust out 2500 miles a week and that is $1425.00! Our drivers can see over 3200 miles a week! That’s a potential of over $1824 a week! Holy💩!!,\n,\nOut for your 70 and home for your 34!!!,\n,\n$10,000 Retention Bonus paid out in 7 installments over 2 years. 💸💸,\n,\n6 months recent experience or 1 year experience in the last 3 years. ,\n,\nAccidents and Tickets reviewed before hire.,\n ,\nCall us now @ 855-210-1300 (We do have staff available on weekends! You work – We work 😜),\n,\nSchedule an interview and complete an application – Spots will fill fast! ,\n,\nGet a jump on it here – If you’re feelin’ 🐸... ,\n,"
  },
  {
    "desc": ",\n,\n\n,"
  },
  {
    "desc": ",\nwww.handsofharlow.com,\n,\nLooking to hire seamstress and or a trainee.,\n,\nWilling to train applicant that show ability to perform the task. ,\n,\n$20 hour and  Additional Compensation for proficient seamstress,\n,\nJob duties include operate sewing machine, adjusting hems, fixing tears, mending zippers, and applying buttons.,\n,\nLocation Newark Texas,\n,\nSend text to 682-365-7897,"
  },
  {
    "desc": ",\nOperating since 1984 and still growing! We work hard to keep our drivers happy!!,\n,\n** 25% - 28% OF REVENUE **,\n**$2,000 SING ON BONUS**,\n* ELD AND PAPER LOG TRUCKS AVAILABLE*,\n* AUTOMATICS AND MANUALS AVAILABLE*,\n* NEW AND CLEAN EQUIPMENT*,\n* HEALTH, VISION, AND DENTAL BENEFITS! *,\n* PAID WEEKLY! CURRENT DRIVERS ARE BRINGING HOME $2500 TO $3500 A WEEK!! (on average this equates to 93 cents per mile)*,\n* HOME WEEKENDS! DRIVERS LEAVE SUNDAY AND RETURN ON FRIDAY*,\n* FUEL CARDS*,\n* IN-HOUSE MAINTENANCE CREW*,\n* TIRE INFLATION AND ROUTINE MAINTENANCE EVERY WEEKEND*,\n* TRUCKS CLEANED EVERY WEEKEND*,\n* PASSENGER PROGRAM AND PET POLICY*,\n,\n****MOST OF OUR DRIVERS MAKE OVER $100,000 A YEAR!****,\n,\nAs a family owned company, we care about keeping our drivers happy. That means great communication and understanding, weekly pay, and home every weekend. We have an in-house maintenance crew to provide both routine maintenance and immediate action on repairs if needed. Automatic ELD's available! APPLY HERE: ,\n,\nDriver Qualifications Include:,\n Valid Class A CDL REQUIRED ,\n• Minimum 23 years of age ,\n• Minimum two-year recent and verifiable flatbed (including tarping) experience ,\n• Clean driving and safety record ,\n• Maintain required productivity standards and exceptional customer service ,\n• Must adhere to all safety requirements and work procedures ,\n• Ability to perform physical requirements of the job ,\n• Ability to work in all weather conditions ,\n• Successfully pass a road test, DOT physical, drug screen, and background check ,\n• Previous oversize hauling is preferred ,\n• No hours-of-service violations preferred ,\n,\nHiring Requirements:,\nNo more than 3 tickets in the last 3 years,\nNo DWI/DUI convictions in the past 5 years,\nMust have experience operating ELD device,\nClass A Commercial Driver's License,\nAbility to follow instructions and complete regular training,\n,\nYou can check us out at www.cowtownexpress.com. Family owned and operated since 1984.,\nCome and join our family!,\n,\nCall 817-590-8686 / 682-348-5820 during normal business hours or text Lawrence at 214-609-8562,\n,\nAPPLY HERE!,\n,\n,\nLooking for drivers ASAP so call for an interview today! We will get you driving same week!,"
  },
  {
    "desc": ",\nKind reliable caregiver needed for disabled man with ALS. Two shifts available, 9am to 3pm and 11pm to 5am. (six days, with Sunday off) ,\n,\nSend your resume to, long3981@sbcglobal.net,\n,\nPlease text (ONLY) Mark at 214-684-4554,"
  },
  {
    "desc": ",\nHello Owner Operator,,\n,\nMID GROUP is owned by two EX Owner operators, with years of experience in transportation and logistics industry, WHO CLEARLY UNDERSTAND YOUR NEEDS. We have active accounts with the biggest companies in the industry; that's what makes us a stable company 365 days in a year. Loads availability is 24/7! That's why Mid Group is 5 STAR RANKED company !,\n,\nYOU CAN SIGN UP ONLINE AND START DIRECTLY FROM YOUR HOME - no worries if you don't have a trailer, we have one next to you !!!,\n,\nWhy choose MID GROUP?,\n,\n✔️ 100% Owner Operators company, NO COMPANY DRIVERS TO COMPETE WITH !!!,\n✔️ WE SHARE RATE CONFIRMATIONS!,\n✔️ Weekly Gross from $8600-$10700,\n✔️ 3.2 $ per mile average,\n✔️ You choose your freight, destination, and home-time. We will not get in your way!,\n✔️ Fuel cards,\n✔️ 90 % FOR YOU IF YOU HAVE TRAILER!!! ( We charge only 10 %),\n✔️ 89 % FOR YOU with our trailer (We charge only 11%),\n✔️ NO LIMITATIONS on truck/trailer year,\n✔️ ELD EXEMPT TRUCKS ACCEPTABLE,\n✔️ 24/7 Dispatch, Safety and Accounting team working for you!,\n✔️ Personal Dispatcher,\n✔️ Direct deposit every Friday,\n✔️ Company reputation is high to the sky (we can get the best prices on the market anytime),\n✔️ Solo or Teams,\n✔️ If you do not have a trailer, haul ours - dry vans, reefers, flatbed!,\n✔️ ELD,\n✔️ Work under our MC,\n✔️ Exclusive discounts on tires, truck, and trailer repairs and much more! Help with maintenance!,\n✔️ Plate program,\n✔️ Safety bonuses (1st, 2nd, 3rd level inspections),\n✔️ RIDER AND PET POLICY,\n✔️ Bobtail insurance program (optional),\n,\nREQUIREMENTS:,\n,\n✔️ Safe driving record (minor moving violations are okay),\n✔️ No DUI,\n,\nCall me or text me at (708) 218 - 9683 – Alexandra and we will get you onboard ASAP!!! You can also apply here at , and we will get back to you immediately!,\n,\n,\n**ALL RIGHTS RESERVED. This content is protected by international and United States copyright laws. Any reproduction, distribution, or republishing of the material is strictly prohibited without the prior, express written agreement of Mid Group Transportation.,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,"
  },
  {
    "desc": ",\nWe are 100% Owner Operators!,\n,\n,\nADA Logistics, Corp. is looking for professional OTR Owner Operators.,\n,\n,\n88% of Total Load Rate goes to the Owner Op!,\n,\nAverage WEEKLY GROSS for solo drivers $10,800.00,\nAverage WEEKLY GROSS for team drivers $12,000.00 - $14,000.00,\n,\nFamily owned and operated, ADA Logistics, Corp. takes pride in treating our drivers as a part of our family. Over 87% of our drivers have been with us for more than seven years.,\n,\nADA Logistics, Corp. understands what it takes to own your own business. Our relationship goes beyond logistics. If you are the type of a driver that works hard, drives safely, and wants an opportunity to succeed in every area of your life, then we have a program for you! We recognize that every team member plays a part in making our company great. At ADA Logistics, Corp. what matters is YOU, which is why we make it our priority to see you succeed as an Owner Operator.  ,\n,\nWhat we do to make YOU successful in an ever changing industry:,\n,\n,\n•\t88% of Total Load Rate goes to the Owner Op.,\n•\tAverage WEEKLY GROSS for solo drivers $10,800.00,\n•\tNational fuel discounts at truck stops.,\n•\tIndependent Contractors Form 1099.,\n•\tRound Trip Lanes.,\n•\tWeekly Settlements.,\n•\tLong Standing Customers.,\n•\tNo sitting and waiting on loads, run 7 days a week.,\n•\tPaid Detentions. Paid Layovers. Paid Lumpers. Paid TONU.,\n•\tCash advances on loads and repairs.,\n•\tOur customers range from small shippers to Fortune 500 companies.,\n•\tDriver Friendly Freights.,\n•\tProfessional dispatch emailed confirmation sheets and statements.,\n•\tELD: KeepTruckin with Samsung tablet (the most user friendly ELD),\n•\tFleet One fuel cards provided, plus Fleet One checks – no fees.,\n•\tBrand new  Wabash and Great Dane trailers available for rent or lease to buy with $0 down payment and no interest rate. ,\n•\tKeeping you informed and up to date on changes with loads -- 24 hour dispatch. ,\n•\tUpdates on FMCSA changes.,\n•\t100% no touch freight (DRY VAN).,\n•\tWe do business with Dry Vans, Flatbeds and Reefers.,\n•\tSafety and Referral Bonuses up to $24,000 annually.,\n•\t24-hour break down support.,\n•\tRun on your schedule and have the family time. Tell us how often you want to be back home and we'll schedule it.,\n•\tTell us what kind of loads you want, we'll ask before we assign anything to you.,\n•\tDo you want to run the country making money? You prefer jumping into your big rig and seeing the country? We got that covered too. We operate in all 48 states.,\n•\tReferences from our owner operators available upon request.,\n,\n,\n,\n,\nHIRING REQUIREMENTS:,\n,\nOur owner ops earn much more than the average owner operator. In return we are looking for experienced drivers: MIN. 2 YEARS CDL-A EXPERIENCE with good driving record, safety scores and previous employment. ,\nWe accept trucks up to 10 years old. Trucks must be well maintained and DOT compliant.,\nWe are an Elite Team of owner operators. Our average driver’s CDL-A driving experience is over 17 years!,\nJoin a family owned business that values contractors - we are 100% Owner Operators!,\n,\n,\n,\nYou can fill out an application online by clicking on the link below (approval within 24 hours):,\n,\n,\n,\nThere’s nothing more you need to do - we’ll take it from here.,\nWe will contact you at the earliest.,\n,\n,\n,\nWe can be reached at:,\n817.458.4188 ext. 101 Sasha ,\n,\n,\n,\nFor more info, visit us at:,\n,\n,\n,\nThank you for your interest you have shown in ADA Logistics, Corp.,\n,\n,\n,\n,"
  },
  {
    "desc": ",\nCall today at 817-484-5999 to schedule an interview for TOMORROW!!!,\n,\nEarn Real $ and/or Build your Dealer Network while assisting Residential Customers in Choosing the Right Home Energy Plans! ,\n,\n$$$ Earn $1000-$5000+ /wk,\n$$$ No experience required PD WKLY + Bonus,\n$$$ Compensation: Paid Weekly + Bonus Package,\n$$$ Bi-lingual agents a plus but not required,\n$$$ Students Welcome to Apply,\n,\n,\nCall today at 817-484-5999 and book your interview today!,"
  },
  {
    "desc": ",\n* ALL OWNER OPERATOR FLEET *,\n,\n* $1000 BONUS PAID ON FIRST SETTLEMENT ,\n* $500 BONUS PAID ~ AFTER 5 LOADS ,\n* $500 BONUS PAID ~ AFTER 10 LOADS ,\n* $155 PASS-THROUGH HAZMAT ACCESORIAL PAID ~ PER LOAD,\n ,\n*Daily Roundtrip Routes from Dallas throughout TX, NM, OK, AR, LA,\n ~ 3 Stops Average Per Load,\n ~ No-Touch Freight,\n ~ Dedicated Customer Account ,\n ~ The Commodity is Paint,\n,\n* We ELIMINATE the \"Smoke-n-Mirror\" Line Items on Contractor Settlements!,\n* Settlements Done ONSITE, Offering Maximum TRANSPARENCY and 24/7 Support,\n* Stable and Growing, Long-Term Contracts with Dedicated Accounts,\n* Hauling Essential Products ALL YEAR ROUND!!,\n,\n,\n*YOU'LL BE HOME EVERY WEEKEND!!*,\n,\n* Stop-offs, Layovers and Detentions are PAID,\n* No Trailer Rental or Maintenance Fees,\n* Safety Bonuses Paid Quarterly,\n* NO Forced Dispatch - EVER,\n* We Offer Referral Bonuses ,\n* We Offer Contractor Benefits ,\n* You Get PAID WEEKLY via Direct Deposit,\n* Fuel Cards with Generous Fuel Discounts,\n* Trailer and Tag Programs Available, if needed,\n,\n** We are seeking Regional Dry Van, Owner Operators **,\n,\nRequirements:,\n• Minimum Age 23 with Class A CDL,\n• Minimum 12 months of Recent and Verifiable OTR/Regional Experience,\n• Acceptable Safety Record concerning Preventable Accidents, Traffic Violations, and Roadside Inspections,\n• No Serious Violations or Accidents,\n• Stable Work History,\n• No Drug or Alcohol Issues,\n• Friendly, Reliable, Courteous, Honest, and Patient,\n• Good Decision-Maker,\n• Safety Minded,\n,\n*As a Priority, We Have and Maintain Very Low CSA Scores!!,\n,\n*Our Safety Rating with the Department of Transportation is SATISFACTORY.,\n*We are a Progressively Growing, Financially Stable, and Diversified Transportation Company.,\n*We are COMMITTED to the Safety and Success of our PROFESSIONAL DRIVERS!!,\n*We believe that Hiring and Retaining the Best PROFESSIONAL DRIVERS helps to ensure our Company’s Future, Protects the Motoring Public, and Guarantees our Customer’s Freight will be Delivered On Time.,\n,\n*We treat Our Drivers with Dignity and Respect, just like a member of our Family. ,\n*We Truly CARE About YOU and We Want You to Be Your Own Boss!!,\n,\nTo Join Our Team,,\nCall Wendy: 972-600-1602,\n,\nSe Habla Espanol!!!!!,\n,\nTo Apply with us:,\n,"
  },
  {
    "desc": ",\n,\n\n,"
  },
  {
    "desc": ",\nJob description,\n,\nCall ***(980) 260-1791***,\n,\nHiring experienced owner-operators with CDL class A to work OTR.,\n- Revenue ranges between $9000-10000 per week for solo drivers,\n- Revenue ranges between $14000-17000 per week for team drivers,\n- No trailers are needed,\n- Paid layover and detention,\n- Paid weekly and with direct deposit,\n- Fuel cards are available,\n- No forced dispatch and 24/7 support,\n- Start working the SAME DAY,\n,\nPay Frequency:,\n• Weekly,\n,\nRequirements:,\n- Clean background and MVR,\n- minimum 1 year of experience,\n- the ability to pass a drug test,\n,\nResponsibilities,\n• For Dryvan: have experience in hauling home goods, paper rolls, totes, various pallets. Secure with load locks and straps. Check for seal and BOL numbers matched,\n• Inspect vehicles for mechanical items and safety issues and perform preventative maintenance,\n• Plan routes and meet delivery schedules,\n• Document and log work/rest periods and miles spent driving and retain fuel/toll receipts,\n• Comply with truck driving rules and regulations (size, weight, route designations, parking, and break periods) as well as with company policies and procedures,\n• Maneuver trucks into loading or unloading positions,\n• Collect and verify delivery instructions,\n• Report defects, accidents, or violations,\n,\nCall ***(980) 260-1791***,\n,\nSkills,\n• Proven work experience as a truck driver,\n• Hands-on experience with electronic equipment and software (GPS, ELD, AVL units, CB, etc),\n• Ability to drive long hours and travel regularly,\n• Extensive knowledge of applicable truck driving rules and regulations,\n• Adaptability and foresight to handle unexpected situations (traffic, weather conditions, etc),\n• Valid CDL and medical card,\n,\nJob Type: Full-time,\nPay: $300,000.00 - $500,000.00 per year,\nExperience:,\n• Truck driving: 1 year (Preferred),\nTrucking freight handling:,\n• No-touch freight,\nType of Freight:,\n• Reefer,\n• Dry Vans,\n• Flatbed,\nTrucking payment:,\n• Percent per load,\nTrucking route:,\n• OTR,"
  },
  {
    "desc": ",\n,\n\n,"
  },
  {
    "desc": ",\nPawn Shop hiring experienced Pawnbroker.  Great store looking for experience and room to advance.,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n,\n, \nPay: Up to 18/hr with Truck or Trailer preferred,\nLocation: ,\nHours: We have shifts available throughout the week starting at 7 a.m. as well as evening shifts starting at 8p.m.,\n,\n,\n\nAs a Service Valet, you will be responsible for nightly door-to-door collection of trash and recycling items within assigned apartment communities. As the face of Valet Living, you will play an integral role in delivering our brand through dedicated service and delighting residents.,\n,\n,\n\n,\n,\n,"
  },
  {
    "desc": ",\nOperating since 1984 and still growing! We work hard to keep our drivers happy!!,\n,\n** 25% - 28% OF REVENUE **,\n**$2,000 SING ON BONUS**,\n* ELD AND PAPER LOG TRUCKS AVAILABLE*,\n* AUTOMATICS AND MANUALS AVAILABLE*,\n* NEW AND CLEAN EQUIPMENT*,\n* HEALTH, VISION, AND DENTAL BENEFITS! *,\n* PAID WEEKLY! CURRENT DRIVERS ARE BRINGING HOME $2500 TO $3500 A WEEK!! (on average this equates to 93 cents per mile)*,\n* HOME WEEKENDS! DRIVERS LEAVE SUNDAY AND RETURN ON FRIDAY*,\n* FUEL CARDS*,\n* IN-HOUSE MAINTENANCE CREW*,\n* TIRE INFLATION AND ROUTINE MAINTENANCE EVERY WEEKEND*,\n* TRUCKS CLEANED EVERY WEEKEND*,\n* PASSENGER PROGRAM AND PET POLICY*,\n,\n****MOST OF OUR DRIVERS MAKE OVER $100,000 A YEAR!****,\n,\nAs a family owned company, we care about keeping our drivers happy. That means great communication and understanding, weekly pay, and home every weekend. We have an in-house maintenance crew to provide both routine maintenance and immediate action on repairs if needed. Automatic ELD's available! APPLY HERE: ,\n,\nDriver Qualifications Include:,\n Valid Class A CDL REQUIRED ,\n• Minimum 23 years of age ,\n• Minimum two-year recent and verifiable flatbed (including tarping) experience ,\n• Clean driving and safety record ,\n• Maintain required productivity standards and exceptional customer service ,\n• Must adhere to all safety requirements and work procedures ,\n• Ability to perform physical requirements of the job ,\n• Ability to work in all weather conditions ,\n• Successfully pass a road test, DOT physical, drug screen, and background check ,\n• Previous oversize hauling is preferred ,\n• No hours-of-service violations preferred ,\n,\nHiring Requirements:,\nNo more than 3 tickets in the last 3 years,\nNo DWI/DUI convictions in the past 5 years,\nMust have experience operating ELD device,\nClass A Commercial Driver's License,\nAbility to follow instructions and complete regular training,\n,\nYou can check us out at www.cowtownexpress.com. Family owned and operated since 1984.,\nCome and join our family!,\n,\nCall 817-590-8686 / 682-348-5820 during normal business hours or text Lawrence at 214-609-8562,\n,\nAPPLY HERE!,\n,\n,\nLooking for drivers ASAP so call for an interview today! We will get you driving same week!,"
  },
  {
    "desc": ",\n,"
  },
  {
    "desc": ",\nLooking for a,\n ,\nDump Truck Driver (Class B) Starting at $21/hr,\nEnd Dump Driver (Class A) $24/hr ,\n,\nHauling dirt and flex base in the Dallas Fort-Worth Area.  ,\n,\n* Full time - Minimum 2 Saturday's a month,\n,\n* Local in Dallas Fort Worth Area (Frisco, Plano, ,\nGarland) ,\n,\n* Work year round,\n,\n* 1 year driving preferred but not required,\n,\nCall today!,\n(217) 801-2364,"
  },
  {
    "desc": ",\nDescription:,\n,\nRugby Architectural Building Products is growing. We are seeking a CDL A Driver. We mostly deliver hardwood and sheet stock, as well as molding, doors and other supplies to cabinet shops and lumber yards; requires multiple stops. This position reports to the Dispatch Manager or the Distribution Center Manager,\n,\n,\nWho Are We Looking For:,\n,\nMotivated candidate required to have a minimum of a Class A valid driver's license and medical card,\nCandidate offered the job will be required to pass drug test, background and motor vehicle pre-employment screen,\nMay be required to pass a driving test as required by the company's truck leasing company,\nMust be able to successfully pass a Valid OSHA approved forklift certification (company training provided),\nFlatbed experience in the material handling industry is preferred,\nExperienced individual who is able to work in a warehouse as well,\nMust have regular and predictable attendance,\nAccommodating individual who is able to communicate with customers and can troubleshoot any issues, that may arise,\nThe ability to read, write and understand verbal and written instructions,\nPassionate individual who will show up to work on time and be ready to start the day,\nCommunicate effectively with co-workers and management about progress of orders and deliveries,\nStrength in time management & completion of independent tasks,\nA team player in all aspects,\n,\n,\nWhat You Will Do:,\n,\nMust be able to pass a physical examination as required by the U. S. Department of Transportation,\nAbility to lift extremely heavy awkward products repeatedly to store, remove from storage, or load onto a truck up to 50-100 lbs. with a helper,\nMust be able to maintain a high level of frequency and intensity in other physical activities such as reaching, standing, walking, lifting, carrying, pushing, pulling, stooping, kneeling and crouching,\nMust have good visual acuity, depth perception, and peripheral vision,\nThe candidate will be required to work both inside and outside in extremes of cold, heat and humidity, depending on the season and location,\nCandidate will be exposed to modest amounts of dust, fumes, noise and vibrations,\nActively engage in Rugby Nation,\n,\n,\nWhat’s in It for You:,\n,\nNo nights or weekends – Monday thru Friday,\nCompetitive Medical – Dental – Vision,\nShort Term and Long-Term Disability,\nLife Insurance,\n401(k) Traditional & Roth,\nPaid Time Off,\nMinimum $22.00/hour,\n,\nThis role is a Safety Sensitive position,\n,\nCandidate is required to be registered in the DOT Clearinghouse to complete pre-employment screening,\n,\n,\nPlease apply online at: ,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n, \nPay: Up to $350 per week,\nLocation: ,\nHours: Sunday-Thursday starting at 7:00pm (FRIDAY and SATURDAY OFF),\n15-20 hours per week,\n,\n\nAs a Service Valet, you will be responsible for nightly door to door collection of trash and recycling items within assigned apartment communities. As the face of Valet Living, you will play an integral role in delivering our brand through dedicated service and delighting residents.,\n,\n,\n\n,\n,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n, \nPay: Up to $360 per week or 720 bi-weekly if hired with Truck/Trailer,\nLocation: ,\nHours: Sunday-Thursday starting at 7:00pm (FRIDAY and SATURDAY OFF),\n15-20 hours per week,\n,\n\nAs a Service Valet, you will be responsible for nightly door to door collection of trash and recycling items within assigned apartment communities. As the face of Valet Living, you will play an integral role in delivering our brand through dedicated service and delighting residents.,\n,\n,\n\n,\n,\n,"
  },
  {
    "desc": ",\n,\n,\n,\n,\n,\n, \nPay: Up to $360 per week or 720 bi-weekly if hired with Truck/Trailer,\nLocation: ,\nHours: Sunday-Thursday starting at 7:00pm (FRIDAY and SATURDAY OFF),\n15-20 hours per week,\n,\n\nAs a Service Valet, you will be responsible for nightly door to door collection of trash and recycling items within assigned apartment communities. As the face of Valet Living, you will play an integral role in delivering our brand through dedicated service and delighting residents.,\n,\n,\n\n,\n,\n,"
  },
  {
    "desc": ",\n‼️Chicago Trucking Company AVH EXPRESS INC‼️,\nNow Hiring CDL-A class Truck Drivers,\n-Lease driver 13% plus truck fee,\n-Owners 12% dedicated lanes,\n-Gross 10-15k and over $3 per mile,\n-Reefers/Dry Van/PO,\n-24/7 dispatching /no forced dispatching,\n-Weekly payroll,\n-Spouse/dog riders are approved.,\n-Lease to purchase any truck with 30%. Everyone is approved,\n-Working with AMAZON, UPS, DAT POWER AND etc.,\nEFS, I-PASS AND etc.,\n-,\n‼️We are based out of Palatine ,IL,\nCALL 312 533 0072 WITH ANY QUESTIONS ‼️"
  },
  {
    "desc": ",\nLumen Lighting and Electric is looking for an experienced Electrician to undertake a variety of tasks relating to setting up and maintaining electrical infrastructure. Your job will involve installing electrical wiring in buildings and poles, troubleshooting malfunctions and blackouts and repairing appliances. Due to the high amount of risk pertaining to this job, electricians must be first and foremost responsible individuals with great attention to safety precautions. The ideal candidate must be experienced in different kinds of electrical devices and systems. The goal will be to produce and maintain well functioning electrical connections to minimize the probability of accidents and maximize usability of electricity in all facilities.,\n,\n,\nmust be willing to travel ,\nOffice located in Lewisville tx,"
  },
  {
    "desc": ",\nBespoke Beauty Brands' team is growing and looking for a detail-oriented, organized, and Excel-savvy Accounting Associate in South Dallas!,\n,\nThe ideal candidate will have a background in Accounting. This role will work closely and under the Accounting Manager to maintain company financial and fiscal records. This will include daily management of accounting, bookkeeping, and financial tasks.,\n,\nWho We Are:,\n,\nWe are creators, innovators, and brand builders committed to delivering the best of beauty and wellness. In partnership with influencer entrepreneurs, Bespoke Beauty Brands manages concept creation, product development, marketing, operations, logistics, warehousing, fulfillment to distribution.,\n,\nOur amazing team at Bespoke Beauty Brands has helped entrepreneurs build successful companies all across the globe. We’ve combined our resources, experience and support to help companies launch, grow and scale.,\n,\nCheck us out:,\n,\n,\n,\n,\n,\n,\n,\n,\n,\nResponsibilities:,\n,\nProvide support to the Accounting Department and Supervisor.,\nMaintain financial records, preparing reports, and reconciling bank statements.,\nAssists in running Quickbooks to process business transactions such as account payable and receivable, disbursements, expense vouchers, and receipts.,\nVerify accuracy of invoices.,\nEnsure BBB’s daily accounting functions run accurately and effectively.,\nRequirements:,\n,\nAbility to solve practical problems and deal with a variety of concrete variables.,\nProven accounting experience,\nFamiliarity with bookkeeping and basic accounting procedures,\nCompetency in Quickbooks and Excel (Pivot tables, Vlookup),\nHands-on experience with spreadsheets and financial reports,\nAccuracy and attention to detail,\nAptitude for numbers,\nData entry and word processing skills,\nWell organized,\nBachelor's degree or a minimum of 2 years experience,\nWork Remotely,\n,\nNo"
  }
]